{"createdTime":1769119848335,"shownInTree":["jane-patterson-and-the-foretelling-diary.html"],"attachments":["site-lib/fonts/70cc7ff27245e82ad414.ttf","site-lib/fonts/454577c22304619db035.ttf","site-lib/fonts/52ac8f3034507f1d9e53.ttf","site-lib/fonts/05b618077343fbbd92b7.ttf","site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","site-lib/fonts/c504db5c06caaf7cdfba.woff2","site-lib/fonts/01dcbad1bac635f9c9cd.woff2","site-lib/media/6155340132a851f6089e.svg","site-lib/media/2308ab1944a6bfa5c5b8.svg","site-lib/scripts/webpage.js","site-lib/media/favicon.png","site-lib/styles/snippets.css","site-lib/styles/obsidian.css","site-lib/styles/global-variable-styles.css","site-lib/styles/main-styles.css","site-lib/rss.xml"],"allFiles":["jane-patterson-and-the-foretelling-diary.html","site-lib/fonts/70cc7ff27245e82ad414.ttf","site-lib/fonts/454577c22304619db035.ttf","site-lib/fonts/52ac8f3034507f1d9e53.ttf","site-lib/fonts/05b618077343fbbd92b7.ttf","site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","site-lib/fonts/c504db5c06caaf7cdfba.woff2","site-lib/fonts/01dcbad1bac635f9c9cd.woff2","site-lib/media/6155340132a851f6089e.svg","site-lib/media/2308ab1944a6bfa5c5b8.svg","site-lib/scripts/webpage.js","site-lib/media/favicon.png","site-lib/styles/snippets.css","site-lib/styles/obsidian.css","site-lib/styles/global-variable-styles.css","site-lib/styles/main-styles.css"],"webpages":{"jane-patterson-and-the-foretelling-diary.html":{"title":"Jane Patterson and the Foretelling Diary","icon":"","description":"It was happening again.Jane Patterson opened her eyes.And what she saw was nothing but nothingness itself. Thick darkness veiled the surroundings from all directions, and only one entity stood center stage: a gleaming, red bathtub. She felt her chest shiver—the slightly painful type of shiver.\"H-hello…? Is… is anyone here?\" she inquired, turning her head away from the tub and checking for any possible reaction. \"I'm scared…\" Her statement was only met by its own echo. Though the scenery wasn't unfamiliar, It still gave Jane the heebie-jeebies. It wasn't her fault the only dream she had was this abomination.Standing in the void amidst deafening silence was something, but being in the same space as that bathtub, was something else entirely. It stank with ominosity, as if knives and hammers swung all round it, or as if touching it would poison her to death, or simply hurt her. The fear was as much instinctive as it was reactional, yet, it wasn't logical, as she had no real reason to fear the tub. With no desire to walk up to it, Jane decided to walk away from it. She moved a good five-meters and turned back. The bathtub was as close as it was before she had moved. Of course, she thought. Nothing new.But suddenly, an idea struck her. Jane was a tiny kid, not that she liked that fact, and due to her height, she was never able to see what was in the bathtub from the distance it was in before. Coming closer to it was an idea out of the picture; out of the room; and out the house, but peeking at what was inside of it intrigued her. She took a long breath and raised her body atop her tippy-toes. Right at the distant end of the bathtub, she saw what looked to be deep, blue water, and the moment that water reflected in Jane's eyes, something squeezed her heart like a stress toy. Suddenly, there was no floor, and Jane was falling at high speed.It was only then, when she truly opened her eye.\n…\nJane jolted awake, her heart racing. The left side of her chin and the shoulder below it were completely damp in drool, likewise the open book in her lap. One of the lines was drenched, but barely readable: Big Bee wants justice. Big Bee wants honey.She looked around in a daze, seeing towers of bookshelves and orange stars made of glass. Did I sleep the entire night? A glimpse at the clock above the broad double-doors showed that the small, chunky hand pointed at IV and the tall, thin one between XI and XII. She pondered for a second as her brain ran calculations. Six… no, no… When there is an I to the left, you take one away… so four in the morning. There was plenty of time before the bell rang and the day began.\"Morning there, missy,\" an old man said, causing Jane to jump and fall on her side. The man croaked a chuckle and bent over his round desk, smiling to her. \"You snored like a hummingbird,\" he said, his gentle eyes unassuming above his round spectacles.\"G-good morning… to… too, Mr. Angelo,\" she said, her mind attempting to imagine what a hummingbird was before she could imagine it snoring. Mr. Angelo drew back and disappeared from Jane's vision. It was best if she went back to her reading, but she wasn't that delighted to go through the book for the umpteenth time. She thought for a moment, and realized a possible solution, though it required her to use her voice again… She shivered, but stood up nevertheless, wiping away the drool off her face. She left her book at the floor, making a mental note to return to it later.\"Um, Mr. Angelo…\" she mumbled, only the top half of her pale, ghostly face, half-obscured by black hair, visible above the desktop, \"Is… is there… is there…\" She was taken back by the fact that Mr. Angelo was reading his book upside down. \"Wh-why… read it that way?\"He looked at the book, back at Jane, then smiled, \"Why not?\"Mr. Angelo was always strange, Jane reminded herself. Back on topic, \"I was… gonna ask. Is there anything you recommend?\"\"Of course,\" he said with enthusiastic body language, \"everything!\"\"How about… um… something more specific?\" Jane was not about read everything, unless that was a book on its own. She looked down for a moment, her pink slippers looked back at her with googly eyes. \"Something… nice?\" she said, looking up cautiously to check Mr. Angelo's expression. His optics drilled into her with a thoughtful look. She looked away again. \"Y-you know… Like all the other ones I read.\"He sighed, \"Unfortunately, you've read all those books.\" Jane heard noises of thumps and papers moving. \"But how about this.\" She looked up and found Mr. Angelo holding up a book with the title The Adventures of Sherlock Holmes written above, and By A. Conan Doyle written below it. She knew this one. \"It has… murder in it,\" she said.\"It's a fine book. Good puzzles and all.\"\"I do not… like it…\"\"It's a little difficult, sure, but—\"\"I don't want to.\"\"You haven't given it a try. If only you—\"\"No!\" she said in Mr. Angelo's face with loud enough volume to leave a trail of reverberation in the room. Upon realizing her ill-manners, Jane covered her mouth and looked down in shame. \"I'm sorry,\" she whimpered.\"You'll eventually run out, you know,\" Mr. Angelo said with a warm, but firm, voice. \"You'll eventually be left with nothing but the books you hate, and what will you do then?\"Jane stayed silent at that. Part of her regretted asking Mr. Angelo in the first place.Mr. Angelo took a deep inhale, then a long exhale. From the corner of her watery eye, Jane saw his hand rise and point in a direction behind her. \"You'll find a new batch of books below Saint Mathew's window. Maybe something there will catch your attention.\"Jane lifted her head slowly. Mr. Angelo returned to his usual smile, but she couldn't help but feel that there was a hint of trouble in his eyes. It was probably her that troubled him. At the very least, she would need to keep her manners in place.\"Thank you,\" she said with a nod, and he nodded too, before returning to his upside down study.\n…\nJane found herself in a narrow passage between the far wall of the library and a soaring bookshelf opposite to it. High above, four stained windows washed the library with color—mainly a soft hue of red, which brought a feeling of tension and religious significance.Like how Mr. Angelo said, there was a pile of unorganized books below one of the windows, most likely Matthew's. She approached the possible pile of time-devouring entertainment and began her search on the floor. From books of languages Jane didn't understand, to books of topics she had no interest in. The pile was starting to dwindle when Jane found something fascinating: an untitled, leather-bound notebook. Who would donate their own notebook? Jane thought as she opened the cover to check its content. Jane Patterson… Like, Me Patterson? she thought, trying to comprehend what she was seeing. Such a bizarre coincidence to find a diary with the exact same name as Jane. The time recorded was also this year. Now much more intrigued, Jane flipped a page and commenced her reading. Dear diary,\nToday, a new year rolls in, and it also happens to be the one year anniversary of my stay at the Pittyfall House of Children as a foundling. My memory hasn't improved one bit. I still don't remember nine years of my life. I still don't remember who's my mom or my dad. I still don't remember anything.\nJane's jaw was on the floor. I don't understand, her brain called out as all the logic units went out of commission. This month-old entry recorded what seemed to be an exact parallel of what Jane had felt that exact day. But that was absurd. There had to be an explanation for this. Jane flipped to another page and continued reading, her eyes mere centimeters away from the paper. Good morning diary,\nAlice Danger found some firecrackers, and from the sounds of the screams, it looks like she's terrorizing the other kids with it. Thankfully, she doesn't come to the library. I found a nice book called We Bumble Bees. It's so fun. I love Big Bee!\nNo, no, no! her head was spinning, and her face was glued to the pages of the diary, so much so that it looked like the notebook was eating her. It felt like she was chasing her own tail, trying to find something besides the obvious. Her heart froze in time. It was difficult to breath, and though the room was warm and cozy, Jane was shivering. From a sitting pose, she fell back down and the hair that covered the right side of her face fell away, revealing a silver eye with an old gash going through it. It was a stark contrast to the eye next to it, which was dark. Her lips were cautious as they shaped each syllable of the words from today's entry.\nGood evening diary,\nToday, I got in trouble and ended up in the director's office. It felt like hours in there, and I ended up losing my favorite book today, We Bumble Bees. I'm so sad…\nThe diary slipped out of Jane's hands and fell on her face. She made no attempt to pick it up, or any attempt to move for that matter. She simply laid down in silence, foolishly attempting to process what she had just read. Hours passed while she was in her diseased pose, not asleep, but fully awake.Were the doctors right when they said I've lost my mind? Or did this diary just predict the future? She thought over the entry: So I'll be in trouble, be scolded and punished for hours, and then my favorite book will be taken? This is the worst! But that was only if the diary is not some prank, which Jane believed it to be, as there was no other explanation.A bell rang in the distance, and though it was typically the most annoying thing to hear in the world, when its so far that it no longer scrapped your ears, it was surprisingly soothing. Jane wanted to sleep so badly, her conscious mushy and soft, slipping away into dream land. But Jane knew what she had in dream land. It was better to not doze off. As she lifted her back, the diary fell away. She pondered momentarily about what she would do with it, but she realized she didn't want to do anything with it. She wanted it to leave her mind, as it was already cluttered. She took the notebook and shoved it in the narrow space between the shelf and the floor. Out of sight, out of mind. When she walked back, she found that Mr. Angelo was not behind the round desk.\n…\nJane was happy that her seat was located at the far corner of the classroom. If that diary had a sliver of accuracy, it would be favorable if Jane was hidden, especially when considering how well her gray attire camouflaged her amidst the colorless light surging through the windows from gloomy clouds.The yapping and barking of children were silenced instantly at the loud yank of the classroom door. A short, plump woman with ginger hair came in quickly, speaking in a professional let's-get-over-with-it tone.\"Morning children.\"\"Good morning, Miss Mary Patterson,\" everyone said in unharmonized unison. It was always strange hearing that surname. A mother? No, just a staff member who gave their surname to a child who didn't remember theirs.With speed and elegance, she wrote the title Psalm 34:4 on the chalkboard and spoke to the children as if she had an eye on the back of her head. \"Desmos, stop eating the paper. You will choke. Louis, stop laughing at Desmos and tell your sister to focus on the subject. Art class can wait. And Alice,\" she turned around and looked down at the blond-haired girl glaring at the kid next to her, \"it's rude to stare. You're gonna make Dean uncomfortable,\" Alice made a huffing noise before she looked away dramatically.Looks normal… Jane assured herself. If something bad were to happen, it wasn't now for sure. As the class went on, Jane decided to immerse herself with the view outside. Dead trees and mud. That was all what the rusted bars had enclosed, that and the grimy Jesus statue in the middle. But behind those bars, Jane saw someone. A tall figure next to a sleek, black car. It was then when the classroom door opened once more. Jane shifted her attention to it and found Mr. Angelo.\"Miss Director,\" he said with unease and began whispering to her.\"Christ…\" She clicked her tongue and went back to writing on the board, \"Tell him the only thing waiting for him here is a beating.\"Mr. Angelo nodded and exited the room. Not a blink of an eye later, Jane found him walking up to the tall man behind the bars. That was fast… she thought and blamed her consciousness for dozing off. A small exchange later, and the tall man cupped his hands over his mouth and yelled.\"Hey, honey. Do not make me get a warrant.\" All kids crooked their heads towards the monotone, yet sarcastic, voice.Miss Mary opened one of the windows with a surprisingly strong motion. \"I'll make you, jackass.\" She closed it and pulled the curtains down. Everyone kept staring at her. \"Back to class—and, you didn't hear me cuss.\" That was met with moans and groans of disappointment.Well, that was not normal, Jane thought, but it wasn't her causing trouble, or being scolded for hours, or having her favorite book taken. Not normal, but good so far…And it was good all the way through, except for the end: class had concluded and kids were scattering when Miss Mary came over to Jane's table. No trouble… No trouble… she repeated in her head. \"Mind helping me organize some papers later, dear? I just have a lot on my plate lately,\" she said.Jane barely heard her over the thumping of her heart. She nodded. As long as trouble was off-frame. She nodded obediently, and received Miss Mary's rough hand as it ruffled her hair.\n…\nJane spent her free time like a pray in the wild, keeping her best to stay safe. Would the person she had just bumped into attack her and make a fuss out of it? No, but they did say she looked like an ugly ghost—it was an upper classmate. Would the floor that had just creaked under her feet break and cause her to go to detention? No, but it did scare the living daylight out of her. Was Mr. Carl about to grab Jane and beat her like he always did with the other naughty children? No, but he did jabber about Jane's tousled hair and her untidy clothes.This diary and its entry were getting to Jane too much. It was probably just a prank. An unfunny and cruel one. She was not about to let a stack of papers get the best of her. Her anger forged her motivation, and she stomped her way through the halls. Her goal: somewhere quiet, aka the backyard.As she reached last corner, Dean passed her, flashing a bright smile. It was only too late when she had realized that he actually said Hello to her. \"Oh—um, h-hi, there…\" she said, but he was way too far to hear her. Dean was one of the few kids Jane considered to be a good apple, and here she was ignoring him. Embarrassment swirled in her head as it slumped down. She only deserved to look at the floor from now on.After a turn, she was seeing surging light from the backdoor making the wood below her brighter each step. It was then when something rolled onto Jane's shoes: a green crayon. She picked it up and read the cutoff text Starlight Color Works (SPECIAL EDIT- in her mind. Nothing out of the ordinary, she thought and a rustle scuttled before her. She looked up, and what she saw there made her heart squelch. It was Alice. Her face was covered in green, and she was out of breath.\"N-no trouble, please…\" Jane trembled.Alice's eyes seemed unfocused, but she saw them glance to the right for a split-second. That was where Jane could not see. She turned her head and faced the worst possible thing to see.Mary Patterson's a BITCH! was written on the adjacent wall with a radiant green color. The same crayon that Jane was holding… Immediately, she snapped her head back at Alice, but she had already ran far in the backyard. In a moment of complete panic, Jane wound up her hand and shoulder, ready to throw the crayon into the next continent if necessary. But suddenly, a rough hand squeezed hers, taking the crayon from it. Though Jane knew who that hand belonged to, she was still aghast when the face of Mary Patterson drew in front of her.\"What a troublemaker,\" Miss Mary mumbled, her eyes at the crayon.Jane wasn't even worth to be looked down upon. \"N-no… It… I…\" she shrilled, attempting to explain herself and failing miserably.Miss Mary looked at Jane suddenly and her expression changed in a way Jane didn't understand. \"Wait in my office,\" she said before leaving.Jane stood still for a while, unsure whether to cry or fall down and pretend to die. She didn't want to be scolded by Miss Mary. She respected her, but now that she knew that diary was correct—that it predicted the truth, however painful that truth was, Jane didn't see how she could escape the scolding.\n…\nThe familiar room felt suffocating.Jane sat on a rickety wooden chair before a desk with a huge pile of papers, a cup of coffee with Don't You Miss Sunday Services! written on it, and a bunch of pill packs with the title Headache Free - NO RISKS and a picture of a pretty lady with a set of blinding teeth set beside it. She felt her body with five times its typical weight, as if gravity was her enemy. Her mind was a collection of staircases and pathways that all lead to the image of how Jane would be scolded—insulted—humiliated. It felt like hours in there, the diary had said, and Jane was living those hours at the moment. Her heart was so jammed in her throat, she felt she would throw up at any point. It all felt sickening.In a minute or two, Jane would have to face Miss Mary's fury for what she had not done, and explaining herself, with her clumsy tongue and such damning evidence against her, felt useless. She was trapped, and she desired to escape so badly. Run out the room and hide somewhere, she thought to herself. Anywhere.The sound of a footstep suddenly slipped from below the door behind her, which did nothing but made her anxiety reach boiling point. Her main escape route was now blocked.As if her body moved on its own, Jane jumped off the chair and zipped to the next best thing: the office private bathroom. She would hide there until Miss Mary left, then sneakily leave after. It was no perfect plan, but it was a plan. Jane slammed her small body against the door as she missed to catch the handle multiple times. At last, she grasped it, swung the door, shoved herself in, and closed it behind her, making sure to click the lock. She glued her left ear against the door and did her best to keep her breathing down.A distant door swung open with a creak. Steps thudded vibrations across the floor. Then, a pause.\"She didn't come, huh…\" Jane heard Miss Mary's muffle.Rat-tat, a postmen-like knock punched the air.\"In,\" Miss Mary said.Another creak later, Jane heard that familiar monotone voice once more.\"Got my warrant,\" the motionless voice said.\"Good,\" she said out of her teeth, \"what's the occasion?\"Jane turned around, discouraged by eavesdropping on Miss Mary when she was this heated. She studied the bathroom she was in as a distraction. A cracked mirror cabinet, an orange, curtained window emanating the fuzzy light of the early afternoon, and one, gleaming, red bathtub.A shiver jolted up Jane's spine and activated something in her head. Something that dragged her out of her body and somewhere far away, sometime far off.\n…\nJane saw a bathroom—a cramped, old one. But not the same one she had just been in. A different one. It reeked of a medicinal smell, sharp and bitter.A dream? she thought, but it was clear she had no control over the body she possessed. This was a memory. A memory that was surging through a crack on the dam of her head.Besides seeing and smelling, she also felt things—intangible things. She felt oppressed and trapped. She felt exhausted and sickened. She felt something rattle at her wrist. It was a chain. She was attached to the faucet of the red bathtub that was full of blue water. She also sensed her clothes fully drenched in that same water. From the mess on the tiled floor, it looked like she had dragged herself out of the tub by sheer force.But atop all those feelings, there was one that washed everything. It was a searing, pulsating pain throbbing in her head. Unbelievably bad, to the point that moving her eyes caused it to intensify greatly.What a miserable place. What a miserable life.She suddenly heard that someone was approaching and every cell of her body screamed in terror.The door behind her screeched slowly, and he walked in.\n…\nJane opened her eye, both of her hands holding her head. It was not hurting—it never did. She breathed deeply, her body shivering. She got out before she understood who he was, but she was very glad. She didn't want to see what was there, and now, she didn't want to stay here. She had to leave.She took one glance at the red shell of the tub before unlocking the door and exiting, her eyes downcast and mouth open. Not a dream, but a memory, she thought to herself.\"Jane?\" Miss Mary said in disbelief, a letter in her hand.Right. Jane was trying to hide. She looked up at her, then to the tall man besides hers, with his purple eyebags and dead fish expression, before she broke down and sobbed. There was much inside of her, from her fear of being scolded, to that awful memory she had just seen. It was like she was trying to speak those feelings, but the words came out as cries and whimpers instead of eligible syllables.Miss Mary rushed in to embrace her. \"Dear, what happened?\" She sounded hoarse. \"Why are you crying?\"Jane didn't answer. She didn't know how. So she cried for a while until the tears dried up and she was left with only sniffles. One positive thing that came out of this was that these cries seemed to have calmed Miss Mary down, because it didn't look like she was mad at Jane anymore.\"Oh, taking care of your little dumplings must be hard…\" the tall man said, \"Now that the orphanage is closing, I believe the difficulty would be bumped into impossible.\"\"C-closing?\" Jane said through sniffles, \"What does he mean?\" she looked at Miss Mary with reddened eyes.\"It's…\" she looked away, \"It's…\"\"Church no longer wants to support the orphans with donations,\" the man interjected, \"I'm sure they have a real good reason for that.\"\"And they do!\" Miss Mary said confidently, \"I'm sure they do…\" her voice trailed off.\"Of course there is. It's called Godeyes. The cult responsible for the many recent goofy activities within the church.\"\"You do not know for sure,\" she said and turned with a pointed finger.\"Of course I don't know for sure, dummy. If I did, I would've put them all in jail already. It's just a matter of time.\"Jane was beginning to lose the topic, but one thing concerned her above all else. \"I-is the orphanage really closing?\"Miss Mary turned to her, \"Don't worry, Jane, I'll… I'll find—\"\"Pardon me,\" the man interrupted and stepped forth between the two, \"Jane? Like, the kid we found in the streets a year ago?\" He looked at Jane curiously. \"Right, Jane Patterson…\" He then shifted into a more deep and thoughtful look.\"Mind shoving aside?\" Miss Mary told him.He moved with no comments, keeping that same look.\"Look, I'll find a new donor as fast I can,\" Miss Mary said, \"You do not worry—\"\"Of course,\" the man interrupted once again, \"how could I have missed this…\"\"What is it now?\" Miss Mary said, her patience running thin and her fist clenching tighter than ever.\"Honey, I believe we can strike quite a beneficial deal,\" he said and came over to Jane, \"A deal that will surely interest you.\" Though he was talking while looking at Jane, he seemed more focused on something beyond her.Jane eyed Miss Mary with confusion and dread as she only imagined what his deal would be.\"What does your deal entail?\" Miss Mary inquired, her eyes hostile.The man kept his eyes at Jane, mumbling to himself with a blank expression, \"Seventeen milligrams per cubic centimeter was what the file had—five times the fatal dose, yet here you are still alive… Of course, how did I not think about that connection.\"\"W-what are you… talking about?\" Jane said as she stepped back. Something about the difficult-sounding medical words, the same ones she heard from her doctors, made her heart sink\"Speak up, and to me,\" Miss Mary stepped in between the two.The man sighed and rubbed his eyes with an index and a thumb, his purple eyebags flexing with the friction. \"I want the small Patterson to help me, as I believe her to be associated with Godeyes, and I'll provide—\"\"Wha—\" Marry spat, flabbergasted, \"you can't be real. She's just a kid!\"\"My evidence are absolute. She can be a valuable asset to my investigation.\"\"Don't you dare call her an asset, you lifeless germ\" Miss Mary growled, \"and you'd have to take her out of my dead, cold, arms.\"A sense of warmth washed over Jane. Miss Mary would go this far for me? she asked herself, but before she felt any flattery by such remarks, she sensed a heavy shift in the air as the man raised three, tall, and bruised fingers.\"Three months,\" he said.\"Pardon?\"\"I can get the church to extend their donations by three months. That is my offering.\"\"I… I don't recall you having any catholic significance—just, how exactly are you planning to get that?\"\"I am in no need to be holy,\" he reached his hand below the edge of his trench coat, revealing a polished, brass shield clipped to the dark fabric above his heart, \"to be convincing,\" he flicked his nail against the PITTYFALL POLICE engraving and it dinged distinctly.An avalanche of silence buried the room. \"J-Jane…?\" Miss Mary said shakily and looked back with most horrifying of expressions: it was that of a pitiful implore.Jane shook her head almost immediately and hid behind the desk. Her heartbeats were banging at her ribcage.\"I... I d-don't remember any… anything!\" Jane managed, and she was mostly truthful. That memory that had splashed in her mind not an hour ago was useless compared to the years she had lost. She still had no idea who her parents were, where she used to live, or how she lost the sight of her right eye.\"I will help you remember,\" the man said with ease, as if what he was saying was the easiest thing in the world.\"Jane, dear…\" Miss Mary began, her voice soothing, yet wavering, \"I'm with you here—really! But without the church's support, we'll be out of food in less than a week.\"Nope. Nope. Nope. Not happening. Godeyes? Police? Jane wanted none of that. Oh, how she we wished to read her favorite books at this moment, far away in the peaceful library. She would be a good girl this time. She wouldn't complain. And she wouldn't open that wretched, wretched, WRETCHED diary ever again. This was all its fault. It had to be.\"I promise you,\" Miss Mary continued, her desperate voice ripping apart Jane from the inside, \"I'll find another donor if it's the last thing I'll do, and as soon as that happens, you won't be in need to help this schmuck anymore!\"Jane felt her determination faltering. It wasn't like she didn't want to help Miss Mary, it was that she was scared. But her desire to payback Miss Mary for all of what she had done was almost as strong.\"Jane…? …I see,\" Miss Mary said, and Jane heard her turn around.Smacking her forehead, Jane pushed herself onto the light and away from the concealment of the desk. She kept her head low, her one functional eye studying the extended shadows of the two adults before her. They were as still as ice. She waited a second, hoping for a miracle to happen. An angel full of pity. A demon that ends misery.Nothing.Jane wanted to cry, but she was out of tears for the day. She nodded her head and whispered, \"I can do it,\" hoping the two might not hear her. Her hopes were dismissed quickly as Miss Mary's short shadow swooped in and engulfed Jane in a hug. Unlike the last one, though, this was dry. No warmth radiated from it.\"Seems like a deal,\" the man said simply.\"Thank you,\" Miss Mary said to Jane's ear. \"Thank you,\" she repeated it, much deeply.\n…\nIt was after classes when Jane had a sudden urge to go reading. Forget what happened, and read. She got in the library, and went to her favorite spot to continue reading We Bumble bees. But the book wasn't in its usual place, slotted between Steven Planet and The Crow House.Then it hit her. She had put it on the floor before she asked Mr. Angelo about a new book, and before she found that… diary. I ended up losing my favorite book today, We Bumble Bees, it said, but it didn't say how she lost it. She instantly assumed it was as a result of the scolding. She looked around and saw that Mr. Angelo was not behind his round desk, nor near any of the shelves.The book had disappeared even though Jane wasn't scolded or punished for anything. If we reconstruct the scene without Jane hiding in the bathroom, would she have been scolded to begin with? Was Miss Mary even mad at her in the first place?Jane sat on the cold floor, leaned against the uneven surface of the shelf, and brought her knees to her chest. She closed her eyes and thought deeply.Today, I got in trouble, the diary had written, and that did happen. Jane was caught red-handed in the crime scene. But when Miss Mary took the crayon out of Jane's hand, she wasn't angerly looking at her saying What a troublemaker. When she did look, she wasn't mad. It was strange, because only now was Jane able to understand that the expression Miss Mary had at that moment was of concern and politeness, of a person who was troubling someone, not being troubled.If that was the case, why did she ask Jane to come to her office? And as soon as the question came out of Jane's mind, a picture appeared in her head: a mountain of papers with pens and coffee mugs and headache-free-no-risks-involved pills scattered around it on a desktop. Mind helping me organize some papers later, dear? Miss Mary had asked. Of course. It felt like hours, was written in the diary, and that was because organizing that mess would've felt like hours.The diary and its foretelling entry was accurate beyond what Jane had imagined, but not to a full extent. It had nothing to do with the tall man nor his deal. It changed because Jane morphed the entry into something it wasn't. She morphed it into a nightmare, then attempted to escape from the nightmare, which had caused fate to punish her, causing things to diverge.But that was silly. Fate punishing a ten-or-so-year-old girl for being a little scared? No, Jane was clearly overthinking things. She made honest mistakes due to the unclarity and vagueness of the diary, and all it did was mess with her head.Disappointed that she hadn't found any ground-breaking discoveries, Jane took out The Crow House and began reading, speeding the clock forward in time.Later that day at night, Jane asked Mr. Angelo and found that he put the book in one of his drawers. Again, just a set of inconvenient misunderstandings. Nothing more.\n…The next day, Jane was having lunch at an empty table in the noisy cafeteria of the orphanage. She looked down at her half-finished serving of mashed potatoes, sinister-looking cabbage, and sludge of beans, as whatever was in her mouth squelched down with the force of her teeth. She swallowed. I thought cooked air was a joke, she thought, tempted to use her knife and fork to take piece of air and compare its taste to her food. If this was the so-called food Miss Mary spoke of, then maybe not having it would be a blessing. Then again, she was only using the food as an example. There were probably many other expenses that an orphanage required.\"Done eating, Patterson?\" a craggy voice came from where her vision didn't work.\"Ueh!\" Jane shrieked a strange voice and hopped a seat in the opposite direction.The man, the same policeman from yesterday, looked at Jane dully, as if he's been doing so for the past 20 minutes. He attempted to morph his lips in a shape of a smile, but it looked more like he needed to pee, \"Nice to meet you too.\"\"Miss Mary… wh-where is she?\"\"Busy.\"Was she already searching for another donor?\"What do you want… from me?\" Jane asked gently. Without Miss Mary, she had no protection from the bear, and worst of all, she had no idea what the bear will do.\"You've been to the Oddmoor Psychiatric hospital, I presume.\"Jane nodded. She hated that place.\"Well,\" he stood up, \"we'll go pay them a visit. Now follow me.\"\"But, but, the doctors… they're—\"\"We're not visiting the doctors. We're visiting someone else.\"Jane stood up and followed suit. The two got out of the main entrance, and beyond the rusty gate, where a black, sleek car stood by.\"Name's Connor, by the way. Now get in,\" he opened the front door for her. Something about this gesture didn't sit right with Jane. It was as if the bear was asking her to enter its den. She shook her head and stepped back.\"No…\" the weight of this deal was beginning to trigger some alarms in Jane's head.\"Fine. Have it your way,\" Connor said, closing the door shut with a thump, \"Will be sure to write to the church very soon.\"\"No!\" Jane proclaimed, her voice cracking.\"No this. No that. You can't no your way out of everything, you know?\"Jane didn't move. She neither wanted to enter the car, nor walk away. It was like a painful game of Tug of War. She sniffled, tears leaking from the corner of her eyes.\"Christ,\" the man sighed, \"how about this: if you go, I will get you a chocolate-filled croissant.\"A what? She didn't know what a croissant was, but she definitely knew what chocolate was, and it was her weak point. She had to swallow, as her mouth was beginning to water. She looked up, eyes not so teary anymore, and asked in a timid, shy voice, \"Really?\"\"Yes. Not part of the original deal. But I can make an exception. Now,\" he opened the car door once again, \"can you get in?\"She did. With some help since the thing was really high, but she did.Sometime later, the car was passing the shade of an arching tree, when the vehicle hit a small bump. The car shook, and a small, sharp paper fell atop Jane's skirt. When she looked up, she saw that the sun flap, or whatever it was called, had moved askew. It must've been where the paper was stuck in. She flipped it, and realized that it was a picture—a wedding photograph of all things. It depicted a young man with golden eyes and a giddy smile, and a short lady with ginger hair.Wait a minute…She brought the picture to the light and focused her one eye. But before she examined it further, it was taken away in a quick swoop.\"I've been looking everywhere for that,\" Connor said.\"That… that is Miss Mary…\" Jane said, astonished.\"Yes. That is.\"\"You two are married?\" Jane couldn't help but sound fascinated by this revelation.\"Were.\"\"But—\"\"No more questions,\" he said with a raised voice, reminding Jane to not poke the bear. He slipped the picture in the inner pocket of his coat, and did not speak again.How did Miss Mary end up with such a douche? He originally said he came to see Miss Mary crumble after the donations stopped, and he was taking advantage of Jane for the sake of his investigation. She simply couldn't imagine it.\n…\nThe extravagant building of the hospital stood imposingly above the horizon; red bricks and towers out the wazoo. A high, wired fence surrounded it, which Jane always found out of place. This was a hospital, not a prison.Connor brought the window down and showed his badge to the capped man at the gate. He nodded and, with a peep, the gate swung open. The Oddmoor Psychiatric Hospital was engraved at the arching entrance. This was the miserable place where Jane was admitted and diagnosed with amnesia one year ago.The clean, sharp smell of the building gave Jane a whiplash—it was as if she had visited the hospital yesterday. Jane walked behind Connor closely, trying her best not to relive the memories. But she couldn't hold them back.She's lying, one young doctor had said to a colleague of hers after asking Jane a dozen or so question, all beginning with Do you remember, and almost all receiving No for an answer, except for one question, which was about her name. That was the only thing she remembered. She's lost her mind, another doctor had said. He was quite old, so Jane hoped he would know what happened to her, but all he did was say she was crazy, even after so many scans. It was such a relief when she was diagnosed and given permission to leave. She would rather live on the streets than stay with these mean doctors.\"Walking down memory lane, Patterson?\" Connor said as he unlocked a metal door with a warning sign, \"Good. Keep it up.\"\"I… wont,\" Jane said, determined to stop thinking and start seeing. And what she was seeing caught her off-guard. The two were in a room that was as white as clouds. Top to bottom, left to right, front to back. The existence of color seemed to be rare here. The walls and ceiling seemed to be made of some… mushy material. There were no tables, no desks, no chairs, but there was, as Jane's head reached the last corner of the room, one bed, and a woman. She felt a shiver spider-walk up her spine and jumped back, hoping to fall out of the room, but the door was already closed. She felt it clashing painfully against her back bones.The sleeping woman wore the strangest jacket Jane had ever seen in her life. It was white with belts at its front and both of its sleeves were fastened together. But that mask. That red-stained mask around her mouth made the life spill out of Jane. She was having difficulty breathing at that point.\"Don't be so scared,\" Connor said calmly. \"This is Stephanie. She's harmless.\" He sat himself next to her, picked her up, and shook her. \"Wake up, sunshine.\"Stephanie opened her eyes wide, her breath clashing oddly against the plastic of the mask. When she realized she was wrapped in Connor's arms, she shifted her body away from him quickly. Muffled, incomprehensible noises permeated from behind the mask.\"I said we'll yap. So, let us yap,\" he said, leaning against the woman and making himself comfortable. \"You know what this is?\" he pointed a finger at Stephanie.What? Shouldn't it be Who? Jane once had a heated debate with Miss Shingle about interrogative pronouns, and by heated debate, she was thinking about one statement and two quiet replies. Regardless, she had no answer either way, so it was a head shake.\"This is a Godeye. A bad one, particularly. Since this goofball got locked up.\" He pinched the woman's cheek and she flinched. \"Godeyes are a cult.\"Stephanie's voice seemed to fluctuate in volume at random, giving the impression that she was under a lot of stress. Jane felt pity.Connor, completely unphased, continued like it was nothing. \"You know what a cult is, right?\"Jane shook her head once again.Connor emitted an exasperated breath and thought for a second. \"It's like a religion, but much nastier. Or, like, a gathering of bullies taking over the playground.\"Got it. Dangerous people. Now can I leave? Please? she would've loved to say that, but she did NOT want that woman to realize she's there.\"They're named Godeyes because—according to the many of them that I've captured over the past three years—they act as an intermediary to God himself.\" He raised his finger and tickled the woman's chin, \"Poor old Stephanie thinking to herself that sky-daddy up there gives a shit about her.\"\"Wh-what exactly d-does this have to with… with the orphanage?\" Jane said it a little frustrated. She immediately realized what she had done and locked eyes with Stephanie, who had just noticed Jane's presence in the room. She still looked terrifying with the mask on, but when Jane focused on her eyes, she simply looked scared.\"Right,\" Connor said, \"they like money, and the church has lots of money, so they target it. When the church begins losing money, it stops being so charitable.\" He looked aside and grumbled, less to Jane and more to himself, \"As long the Pastor has his silk robe, who would care for the orphans…\"It made sense, but this still didn't put the last piece of the puzzle in place. \"Why me?\" Jane asked, almost desperate. Why of all people, was she roped into this? This was meant for someone brave, strong, and mature. Not Jane…Connor paused for a while, studying Jane. \"Good question. Why don't we ask her.\" He held the woman firm from her shoulders and began untying the mask from behind her head. As it fell off her face, the muffled words Jane had been hearing finally cleared up.\"Please, God, hold my spirit. I beg you, angels, write my death. Please, God, hold my spirit. I beg you—\"It was as if a switch had been flipped in the Jane's mind.Why did this sound so…Familiar…\n…From the dark corners of Jane's mind, a scene was being fabricated. The five senses immerged one by one: the discomforting touch of sticky socks against cold wood, the taste of hunger and saliva, the muzzy sounds of dogs barking and howling in the neighborhood, the intense smell of fresh alcohol, and finally, the image of a folded page with one side that read A Poem for Dad (Hope you get better soon) written with flowers and roses decorating it. The vision presented in the memory seemed wide, more complete than that of Jane's current vision.Beside the tangible feelings, Jane felt other stuff that weren't so vivid. For instance, she felt that she couldn't forgive him. Though, she didn't know who him was. Her only assumption was this Dad figure from the folded page. She also knew that she hated him, and that she couldn't let go of him; furthermore, she felt an immense amount of pity for him. Jane wasn't sure what to make of these feelings.Suddenly, a mournful voice, riddled with tears and sniffs, came along from ahead, \"Please… God, hold my spirit. I beg you, angels… write… my death.\"Jane put down the paper, and there was a door with light bleeding at its edges before her. She sensed some fear trickling in her veins, freezing her, but suddenly, it all vanished. Uncertain determination. That was her feeling as she swung the creaky door open to reveal a simple, yet cramped kitchen. Though, Jane's eyes focused on nothing other than the shadowed man below the round table.\"Dad?\" she asked, her voice higher-pitched than she'd anticipated.The man kept rocking. He was squeezing something against his bare, left arm. Something blue…\"Please… God, hold my spirit—\"\"Dad,\" Jane took a step forward, her stomach hurting from the shivering. The man, having been interrupted, stopped moving. Then suddenly, he looked up like a wild animal. It was at that moment that Jane realized interrupting him was a big mistake.Something bad was about to happen. Jane knew it.The moment when the man's shadowed face was brought to light was a short one, as his face expanded in Jane's vision so quickly. Her body couldn't react in time. She only managed to close her eyes shut, before pressured pain zapped at her right eye.\n…\n\"Patterson?\"Jane blinked, and whatever she was seeing, she was no longer seeing. Her left eye saw the padded room, and the vision of the kitchen was fading from her right eye.\"Snap out of it, Patterson.\"No alcohol stink, no barking or howling in the distance, no ferocious expression, and no pain. Though, it did sound like someone was calling for her…\"Patterson!\"Jane let out a startled Huh before refocusing on the hawk-like man in view. Tense eyes and serious brows. That wasn't typical of Connor, at least, not of the little Jane knew of him. She also found it strange that he was kneeling.\"What did you see, Patterson?\" he said, his voice that of desperation and anticipation, \"What did you remember?\"What do I remember… she thought, the prayers of Stephanie constant in the background. It was the same thing. The two were reciting the same prayer. Jane Patterson's father was a Godeye. He was a bully. At that moment, something broke inside of Jane. She had hoped that, maybe, if she got her memories back, she would be welcomed into a loving family, or any family for that matter. Now, there was nothing for her.\"Patterson, answer me,\" Connor pushed harder. His tone commanding, rather than inquiring.At least she had Miss Mary as a caretaker. She had the Pittyfall House of Children as a home. And this home was in danger, from Godeyes and the church. If Jane gave Connor what he wanted now, there was a good chance he would dispose of her as an asset. In doing so, he might also dispose of the idea of forcing the church into paying donations. Godeyes hurt the church, but not the orphanage. The person who can truly do that at the moment was non-other than Connor himself. He promised three months, and Jane would get as much as she needed for Miss Mary to find another donor.\"I don't remember,\" she said with a heartache. What she was doing was bad. But she had no choice.\"Do not lie to me, Patterson.\"\"I'm not lying,\" she looked directly in his eyes, and for once, she didn't care what he would do—what anyone would do.Connor grumbled a noise before ascending himself up. \"No croissant for you,\" he said bitterly.On the way back, Jane thought about how this day went and couldn't help but feel powerless. Fate had dragged her from bad to worse, and it made her frustrated. If only she could avoid fate, avoid memories, avoid Connor, and, as much as this thought seemed ridiculous, it was far, far more probable than anyone realized. This time, though, she would do it right. No misunderstandings. Hello diary,\nToday, I was taken to that horrible hospital again, all because of Connor and his dumb deal. Though I expected I would remember nothing, I ended up remembering something about my dad. He was the one who took my right eye. And apparently, some member of a bad cult, too.And here I thought something good might come from my memories. I guess that was a silly idea.Regardless, I won't be helping Connor or his case at all, not until I get the three months of donations he promised in the first place. Jane felt something she hadn't felt in quite a while. Alongside the narrow river of sadness, and beyond the hills of uncertainty and the mountains of fears, there was… astonishment. It got everything right, Jane thought to herself in a hazy mind. All that had happened earlier today was recorded here as if Jane had written it herself. But Jane knew better… She didn't write this, the diary did, and as far as she knew, this diary didn't just record the past, it predicted the future.Below Saint Mathew's delicate twilight, and in the corner of a quiet library, the sound of a single paper flipping reverberated. Good evening diary,\n&nbsp;\n\"What…?\" Jane uttered without realizing. She scanned the delicate, ecru page, but nothing was written besides the greeting at the top. Jane looked to its opposing page. Hey diary,\n&nbsp;\nIs the diary a fluke? she thought, but immediately realized how improbable that was. This notebook had proven to be far more than just a stack of papers. There must've been something wrong. She flipped to the next page, and still, there were only greetings. She skipped over to March, and the same met her. Sometimes, she got a Hello diary, sometimes a Good evening diary, and sometimes some other greeting entirely. Howdy diary was in one of the April pages and she was baffled she would write something like that. She flipped a good third of the notebook forward and saw, strangely, that the greetings had vanished.Where do the greetings stop?She flipped back all the way, and once a glimpse of dark ink met her eye, she stopped. Opposite to the diary entry of April 30th, which had a humble Hi diary, a page bore one word at its center.\nBeware Jane felt a shiver creep down her spine. The electric motion moved her hands together to snap the notebook closed. Beware… of what? she thought, her brain knotted in confusion. But that April 30th date next to the page intrigued her. That date was exactly three months from now. It was the same time for the limited donations given by the church.Jane plopped her head down and brought her knees inward. She thought long and hard about this, about the possible danger to be aware of. Would we lose donations and live off the streets by then? Would I die of hunger and cold? Is that why there are no more entries past April 30th? And what does Connor, the church, or that cult have to do with any of this! It was too much to think about, and Jane Patterson was not much of a detective herself. She recalled what Mr. Angelo said before: It's a fine book. Good puzzles and all. He was talking about that Sherlock Holmes book, and perhaps, if Jane had read it, she would've been smart enough to connect the dots.More importantly, why is tomorrow's entry empty? she thought as she reopened the notebook to February 5th. This needed further investigation, and Jane felt that having the diary with her would be better than having it in the library.She got up and out of the alleyways of bookshelves. The clock and its two hands pointed at XI, which vaguely told her that it was quite late. Mr. Angelo typically had other duties to fulfill besides the librarian one, and she was thankful he wasn't here to see her with the diary. Avoiding questions was preferable. But he was there when Jane came in. He gave her We Bumble Bees and told her he found it on the ground the day before. Jane was thankful for that, and for having that book back next to all the other ones she liked.She zipped quietly out of the library, and some dark corridors later, she had reached her dormitory: Girls Dormitory C. Jane approached the metal doorknob, and in a bang, the wood plane swung open with a magnificent motion, and two girls sped past Jane.\"Lucy's got a boyfriend~♪ She drew his muscles down~♪ Their lips are on fire~♪ Call the firefighter~♪\" \"Emily, get Christopher back! He's got motion sickness!\"That was close… Feeling like she'd dodged a bullet—more like two bullets—Jane made her way in, where which a barrage of chatter surrounded her from every direction. One short girl was hanging from the slowly spinning ceiling fan as she snoozed, mumbling \"Sugar… spice… and everything that is nice…\" repeatedly. Another one was platforming over the top of bunkbeds, pretending to be some pirate jumping over ships. A group of five girls played with battered cards in a circle. \"Not the old maid again!\" one of them said with a long ugh. Jane had to walk carefully around them, as they didn't bother moving slightly out of the path they clearly have blocked.Finding her way amongst the two rows of bunkbeds stretching to the end of the lengthy room had become muscle memory. Add on that her bed was the only one with makeshift curtains around it. It was the one place in the world where she could have a scrap of privacy. No one would ask or interact with her there. Kids got used to the pale ghost who lived in our dorm. They got used to the quiet little girl with a silver eye and a gash. Everyone did, even the problematic ones, such as Jane's upper neighbor, Alice Danger.The thought instinctively lifted Jane's head, and without noticing it, she locked eyes with Alice's blue ones. Alice was lying on her front and playing with stones in her hands. Jane noticed a bruise at her chin, and what seemed like leaves and twigs stuck in her blond hair. Another fight, probably, Jane thought.\"What are you looking at?\" Alice said with a frown.Jane shook her head, \"N-nothing.\"\"Your tummy got the ugly juices or something?\" Alice kept her stare stern, her hands tight with the two stones.The what? Jane looked at her stomach and realized she was holding the diary against it really tightly. It must've looked weird.\"I—\" Jane tried to say, but a high, nosy voice swamped the dormitory.\"Keep it quiet, devils.\"Jane looked aside and saw Miss Shingle's flashy square glasses down at her long, crooked nose.\"If you wish to not starve tomorrow, then go to sleep. Now,\" she said, more out of her nostrils than out of her mouth.Everyone groaned and jumped to their bed. Miss Shingle was cursing while pulling the short kid off the ceiling fan. This, thankfully, had diverged Alice's attention away from Jane. She seized this chance and hopped to her bed, closing its curtains behind her.That night, she spent nearly an hour checking the diary over and over again, but February 5th had nothing to tell her. It was nearly midnight when Jane hid the diary below her mattress and decided to sleep—or more, her body decided. It was an exhausting day, and regardless of how thin her pillow was, how cold the room was, or how her mind kept spinning around recent events, she closed her eyes, and the world fell in darkness.\n…\nThe ground was cold.\"This is what you deserve!\"Jane's body was screaming. Her face was an amalgamation of drool, snot, and blood.\"I've told you time and time again to not to interrupt me!\"She didn't know whether she was on her knees or her back, as all she did was wail.\"What have you brought? A poem? What will that do!\"The intense aroma of iron, and the clogging of her nose, and the piercing ringing in her ears made the world spin.\"You are truly the spitting image of your ugly,stubborn,WHORE MOTHER!\"But suddenly, it went away.Jane was sweating profusely at her bed, her arms limp next to her. She didn't know if her lungs were functional, but she could barely breathe. Her mouth was so dry, she was sure a tumbleweed would start rolling on it any second now.Him again… she thought, and didn't want to think again.She fell back down and breathed a large sum of air. She needed to stay very calm and very still, because one wrong move, and she would vomit her entire stomach out.\n…\nAfter an hour or so, an image popped into Jane's head—the diary! That was what she needed to get her mind off things.She popped her head out of the front curtain and checked things around. It was nearly 8 A.M. from the clock above the cracked window at the end of the room, and kids were beginning to wake up. Alice must've fell off the top bed, because she was on the floor with all her limbs spread out in random directions. It looked like someone scribbled I suck a lot on her forehead, then drew some strange, curved shapes on the rest of her face with a green crayon—its shade a bright and radiant color. What did she do now… The circle of five, the same ones who were playing the maid card game the day before, were now huddled together in their section of beds in the dormitory. They were giggling and talking about boys and Shingle's long nose and Dean and—wait, Dean? Jane focused her ears more.\"Went to get a glass of water and found that Evergreen kid begging Angelo about mail or whatever.\"Madison billowed her long, red hair, \"He's fresh from the oven. His momma's probably…\" she made a pig-like snort before she went on, \"lost him somewhere.\"\"Yuh,\" one of her shorter minions said, \"probably waiting for some response.\" She then went on laughing as the group laughed along.Poor Dean, Jane thought, her heart sinking for him.But the diary was what mattered now. She would think about Dean later—after all, every kid here had some sob story with them. She slipped back into her dimly-lit chamber and took out the leather-bound notebook, praying to who-knows-whom to find something. She flipped page after page onto February, and her heart was racing.She stopped.Her vision almost blurred intentionally to avoid looking at what was in the entry, but she could clearly see that it had far more ink now. She gulped her dry mouth, sharpened her sight, and began reading. Good evening diary,\nToday, I was bullied. My ribs still ache and my nose is dry with blood. Now that I had time to think about it, it was clear from the beginning, wasn't it? I should've seen it coming. I feel stupid.I feel so stupid.Jane fell in silence.Bullied…? Why? She instinctively caught her ribs and imagined the pain, and for some reason, she was able to imagine it quite vividly. She shivered. It was clear from the beginning? I should've seen it coming? What was Me from the diary talking about exactly? It wasn't hard to imagine who would bully her. The list started with Alice, then Madison and her four doggies, then literally anyone who can be slightly mean. But from the sound of it, shock was the tone of Diary Jane when she'd written the entry.This was quite the riddle, and as much as it scared here, Jane felt a sense of relief that the diary worked to begin with. One, Jane was not crazy, and two, she can prepare for it. Now she just needed to be vigilant of who this bully could be.Suddenly, a thud hit the ground and then the noises of girls gasping played in unison.\"Why'd you throw me a leg, Danger!\" Madison said, and she was close to the front of Jane's bed.Jane peeped through the curtains and found Madison, who seemed to have fallen on her butt. Alice hopped up on one leg in front of her.\"Throw you a what?\" Alice groaned, \"didn't you just—\"But she was cut off by one of the Madison's girlies pointing at Alice in the face and saying, \"Ohmagosh, what happened to her face?\"Madison stood up and patted her rear. \"Didn't know you're into sucking, Danger.\" She made one Hah! sound before she went on. \"It really suits you, you know?\"\"Shut up!\" Alice shouted.\"Or else…?\" Madison said with a wicked grin, \"Wha'cha gonna do? Hit me? You love to do that with everyone, don'cha?\"\"Don't tempt me,\" Alice growled. She looked around her and saw that everyone had woken up to witness this. After considering it, she clicked her tongue and walked out, \"You all stink!\" she mumbled as she shut the door behind her.\"What a loser…\" one girl said, and the others began mumbling the same sentiment.Both Madison and Alice were fine bully specimens, but if there was someone who would ache ribs and break noses, then only one of them would fit the criteria: the one wearing a deep black skirt and a blazing red shirt with a warning sign on it. Aka, my neighbor.\n…\n\"Come on, children! Pour your soul into the paper—be the paper!\"Miss Dervla spoke in a floating-carpet-like voice—smooth and silky across the cold morning air, and her body language was exaggerated with hands motioning and spine turning. It was really difficult not to fall asleep to her voice. Thankfully, Jane's rare possession of more than four hours of sleep had helped.\"Reflect your innermost turmoil in the vase that you will be drawing. Now, can anyone here tell me what turmoil is?\"\"Is turmoil a bug?\" Alice asked while picking her nose.\"No,\" Miss Dervla said without looking her way.\"Oh! Is turmoil an organ? You did say inner,\" Madison said with a prideful voice, smirking to her friends.\"No,\" Miss Dervla said and the five girls all frowned in gloom.\"Can I eat it?\" Desmos said as he adjusted his thick glasses.Miss Dervla ignored that one.\"Um,\" Dean muttered as he scratched his tidy, brown hair, \"isn't it, like, bad uncertainty or something?\"Miss Dervla turned around, her cosmetic-blue eyelids fluttering in a pleasantly-surprised expression. \"That is correct.\"Jane obviously knew that, but she saw no desire to participate in such activities—mostly because her voice wouldn't be loud enough to reach Miss Dervla. Dean being the only other person who knew the meaning of that word made Jane feel a strange… feeling. A happy one. But it also felt special. She didn't understand it.Suddenly the word Nerrrddd snaked around the class, and everyone chuckled as a response.\"Who said that?\" Miss Dervla's voice froze in temperature—a complete opposite to what it was before.Dean pointed a finger forward, \"It came from the front seats, Miss.\"The front had only Desmos, which didn't have the guts to do this, Lucy with a big, red ribbon, who was busy drawing like crazy, her twin, Louis, who was sleeping, and then Alice, who everyone was looking at.\"Miss Danger!\" Dervla stepped forward with force and power, her heels stabbing the ground. She loomed above Alice, her bright, red lips pursed and her eyes crosses of death. \"Apologize right now.\"\"But I didn't say—\"\"Apologize,\" Miss Dervla shot, and Jane's heart tumbled in fear.\"I… I'm sorry,\" Alice said in a miserable voice, her eyes downcast and her shoulders droopy.\"Good. Now then, kids, back to the vase. You'll have approximately an hour,\" The tall lady said as she took off the cloth off a big, maroon vase that sat atop a dilapidated roman column pedestal. The cloth hit an adult, female puppet model next to the open entrance, which caused its head to fall off. \"Oops,\" Miss Dervla said in a peaceful voice and the kids laughed.The blank paper and the pencil next to it yearned for Jane to use them, but even if she was given a century, she wouldn't be able to draw a vase-looking vase anyways. At least I know what I'm drawing when thinking of a vase! But for what's in it… She looked around. Inner turmoil… If I were to draw one of you, who would I draw? Everyone was drawing in quiet. She glimpsed at Dean. He seemed nearly done, as he was coloring the vase in bright green with his battered-looking crayon.Something poked at Jane's heart sharply—like a needle.It was bizarre, because not once had Jane seen this shade of color in the orphanage within normal circumstances. Most of the ones she'd seen had an uglier, paler color than this bright one. She recalled the first time she saw the markings of a familiar green crayon in abnormal circumstances, the Miss Mary's a BITCH writing on the wall that Jane thought had gotten her in trouble. But that was Alice's doing! she thought. And also, Miss Mary took it from me… Was there a chance the crayon had returned to its owner? No, if Alice got it back, she wouldn't use it to write that stuff on her forehead… And, actually, what about those? The writings on Alice's head was also from a bright, green crayon. That was the second instance that coloring pen had come into the picture alongside Alice herself. But only in the first case was Alice a plausible owner of the crayon. It wouldn't make sense for the second instance. And regardless, there could be multiple crayons! Who knows! It just couldn't be that Dean, the sweet and innocent kid who was the only one to acknowledge Jane's existence, was the same one who wrote that text on the wall, who wrote those scribbles on Alice's face. That was seriously beyond ridiculous. Jane slapped her forehead. Stop overthinking things, dummy! She took a long breath, calmed her steaming brain off, and went back to drawing her mostly-mediocre-looking vase.Five minutes before the clock hit 9:30 A.M., and right as the sun brightened the room in its morning bloom, Jane had finished her… piece. It could look worse, she thought as she scanned the scribbled lines drawn atop a multitude of faded ones. Her lines were unstable and all over the place, unsure whether to be here or there. Her vase had two eyes, and like Jane, only one was functional. The other had a bunch of circles and Xs hiding it. In the end, she felt like her turmoil was less a bully or a tangible thing, and more herself. Her finger rubbed against the Jane Patterson sign to the bottom of the page. Is it narcissistic to draw yourself? she thought, but it was too late to change mindsets. Maybe someone else drew themselves? she looked at the other kids ahead, noticing that Alice was drawing some strange creature on her paper, and Desmos was scribbling random lines. Perhaps not… her head felt hot.Click, click, click Jane heard Miss Dervla walk in rhythm, coming in-between the two tables of Desmos and Alice. She raised the two from their wrists to standing height. \"What am I looking at exactly?\" she said to Alice.Alice looked irritated. \"It's a frog.\"\"And did I ask for a frog?\"\"No, but who cares? I wanted to draw one.\" Alice was tall enough to barely stand on the edge of her shoe, but Desmos was shorter and he was basically hanging from his wrist.\"And what about you, Simpleton? What creative visions have you brought to the so-scarce paper we provide to you?\"Desmos made a whining noise and shook his head, his glasses falling to edge of his nose.Miss Dervla suddenly put the two down and smiled, clapping her hands together. Her voice then burst in a laugh. \"I love the creative ones,\" she said, wiping a tear off her cheek. She let the two drop back to their seats and went to the front of class. \"I suppose our time is over. Please leave your works right here,\" she stood behind a table and laid a pale hand at its rusted surface, \"and I'll be immersing myself in understanding your inner-turmoils. Dismissed.\"Desmos made quick work of putting his paper down and leaving, followed by Alice, then Dean, then everyone else, ending with Lucy after she put the last touch to her masterpiece full of shapes and shades. Jane came in last—not wanting to push or be pushed—and put her paper down before she got out the classroom. Expecting a somewhat empty hallway after all the time she'd spent waiting for everyone, it was surprising to hear a ruckus. Kids of all heights stood around some attraction of sort. As much as Jane didn't want to deal with this, the other side of the hallway was a dead end. She thought of forcing her way in, but remembered the diary: My ribs still ache and my nose is dry with blood. This could be it, where Jane became the target of bullying. Yet, once she had decided to stand and wait, a voice echoed from the crowd, loud and clear.\"Why did you hurt him, Alice?\" It was Dean's uncertain voice.Suddenly, all concerns had vanished from her brain and she wanted to see what was happening, especially when it involved Alice and Dean. Not trying to prove anything, she reassured herself, thinking back to the green crayon.She attempted her best to slip through the audience until the scene became visible through gabs in-between silhouettes of heads.\"Leave me alone!\" Alice demanded, her blue eyes were dots tension, and her yellow hair completely ruffled over her face.\"Why did you hit Desmos?\" Dean took a step forward, his chest was heaving and his green eyes shaking.Desmos? What's wrong with him? Jane searched around and found him on his knees, sobbing silently as he held his wrist in pain.Alice shrugged, \"I did noth—\"\"You really love lying, don't you? Just like how you did back there,\" he pointed to his right, beyond Jane, and towards the classroom.\"You always—\" Alice yelled out, and then someone pushed her from behind. \"Hey, who did that! Not cool!\" Another kid then kicked her hard on the back, dropping her on all fours. \"What is wrong with all of you!\"The crowed kept their eyes on her, most was sparkling with rage.At least Jane's wasn't wrong. Alice was, yet again, the No. 1 culprit in a bullying scenario, and once more, she lied about it.A growl rumbled in the air suddenly. Alice's teeth gnashed hard, her gums stuck out. In a swift motion, she jumped up and grabbed Dean by the collar of his brown buttoned shirt, bringing him down to the floor. She began by a straight punch to his cheek, and by that point, the crowed had gone wild, and Jane was pushed back out of it. The kids chanted The brave brings out blood! The brave brings out blood!\"No!\" She shrilled and attempted to go back, but she was easily dragged all the way out of the crowd. She got hit in the head and pushed from the back and stomped on by the foot, and as she popped out the back of the crowd, a familiar monotone voice cut through the action.\"Well, well, well… Children fighting on my watch? I think it's my lucky day. Unfortunately, I've forgotten my popcorn, so I'll kindly ask you bunch to stop immediately.\" Everyone froze, looking directly at him in a scrutinizing way. The crowed had cracked to form one hole where Jane could see things through. Dean and Alice were motionless in a pose where Dean had finished winding a punch towards Alice in the face, but just hadn't pulled the trigger yet. Jane looked away and at Connor, hoping to see anything but Dean and his ruffled brown hair, or his heavily-breathing chest, or his ferocious expression that reminded her of things she didn't want to remember.Connor smiled to the closest child next to him. He dinged his badge and said, \"I'll put you in prison if you don't get out now.\"Like lightning, everyone made a run for it, making sure to avoid Connor at all costs. Alice and Dean did the same, and as Jane took one step forward, Connor raised a wagging finger.\"Tsk, tsk, tsk… You stay right where you are, Patterson,\" he looked with his hawk-like golden eyes on Jane, and like a pray, she felt immediately cornered. Nowhere to run, no one to help her.Could this day get any worse…\n…It was unsettling to see Connor behind Miss Mary's rickety desk.\"W-where is she…?\" Jane asked through rigid lips.\"Don't worry about it,\" he said as he brought out a stack of pictures out of his coat inner-pocket. \"Your job's easy today, Patterson. See the pictures. If you remember anything, you will tell me.\"It won't be a will, Jane thought to herself, but then remembered the diary entry. But what if he realized I'm lying and beat me up like how the diary said? It was plausible, but the only hitch in that theory was the fact that Jane didn't find herself calling Connor a Bully for beating her. She would probably call him a criminal.Connor flopped a picture onto the table. It was a black-and-white photograph of Stephanie. She had her hand wrapped around her head, and she looked as thin as a straw. Jane's heart pulsed in pain. She didn't know what Stephanie went through, but no person deserved to look like that.\"You already know our dear Stephanie, but how about this fella.\" He threw another picture. It was of a bold man holding up a black board with digits and letters on it. Jane noticed the mention of the Pittyfall Police Department at the top of the board. The man did not look friendly.Jane looked up and saw Connor scanning her with those tired eyes of his, with their purple eye bags and saggy eyelids. She shook her head.He threw another picture, and Jane shook her head again, and then another picture, and another shake. And then Connor threw a photo of a man sleeping in a plastic bag with its zipper half-open. He had hazy and seemingly confuddled eyes that looked inhumane, and his forehead had GOD LOVES ME written in blue. It was when Jane had realized that the man looked as white as snow that she had realized he was dead. Her heart plummeted. She looked up in horror, eyes wide and face colorless, and Connor still had that same analytical expression.\"Godeyes love to get rid of their fallen members,\" he whispered. \"Burn an apartment, steal a body, or bribe a prisoner to silence a snitch—it's all in their books. Sometimes, we can't take a proper mugshot of the member before they take'em, so we end up with these.\"\"I… d-don't want to do this anymore,\" Jane said with a hoarse voice, feeling her stomach getting sicker by the second.\"Of course you don't, neither do I. But here we are.\" He threw another picture down. It was of a skeletal woman who had hanged herself by the ceiling fan. Her face was plastered in blue bruises, or something blue for that matter, and her eyes had rolled up to her skull. Jane's stomach riled, as if her intestines wanted to escape her body. She force-closed her mouth, her body shivering.\"Look at the picture, Patterson. The sooner you do, the sooner we're over with this.\"Jane's throat felt clogged in something. In teary eyes, and against her better judgement, she peeked back at the dead woman. Instantly, her stomach gave away and she fell on all fours, vomiting greens and whites on the floor. Her whole body shook to its core.In that moment, Jane heard the sound of the door behind her open and the light from beyond it filled the room.\"Connor? Jane…?\"She knew that voice.\"What is happening…?\"Jane heard footsteps close in and then felt rough hands hold her from the shoulders. \"Oh my god! Are you okay, dear?\"Jane's face was a complete mess. From tears and snot and vomit splashes, it was an ugly combination. She shook her head.\"Maybe I went too far…\" Connor said in a somber tone Jane hadn't heard before.\"You think?\" Miss Mary spat and stood up. Jane was still dizzy, so all her view was just the colorful liquids on the floor.\"What are these? You're showing her pictures of dead people!? Are you out of your fucking mind?\" Jane had never heard Miss Mary have such a chainsaw voice before.\"These are associated people, Mary. There is a chance she would remember some—\" His nonchalant words were cut off by an extremely high-pitched slap.\"Get out,\" Miss Mary hissed.A sigh and some footsteps later, the door of the room closed.Jane got herself up, still shaking. There was things she wanted to tell Miss Mary, but as she approached her, all that came out of her mouth was a sad noise that resembled mwaaaahhh. Miss Mary squeezed Jane into her warm body, and Jane began hiccupping cry after cry, with more sad noises in-between.\"I'm so sorry I got you into this mess,\" Miss Mary muttered with a deep breath. \"It's all my fault! If only I was a competent director!\" Her squeeze tightened. \"If only I was a competent person!\" She squeezed even harder. \"If only I was a competent mother!\"The embrace loosened, and Miss Mary looked down in shock. Her wide eyes, which looked as exhausted as Connor's, sobbed thick tears down her puffy cheeks. Curly, ginger locks of hair surrounded the disc of her face vine-like and messy.\"I…\" she breathed out.\"Where were you yesterday?\" Jane said in a lifeless voice. She wanted to know why she was left alone with the bear. It felt like she had abandoned her, and that hurt her.\"I was…\" she closed her eyes and looked away for a second, that second where adults took to consider lying to a child, \"I was in a hurry to search for any replacement donor. I got out as soon as we finished talking. I'm sorry…\"Jane gave her a weak smile. \"Thanks for not lying.\"\"Well, it's,\" she teared up more, \"it's just so ridiculous!\" She stretched her hand and gently brushed Jane's cheek. \"How could anyone—especially those who follow God's will—say no to helping kids like you…\"\"We still got three months, no?\" Jane held Miss Mary's arm, but Miss Mary pulled it back.\"You've got nothing… to worry about, dear.\"\"But,\" as much as she hated the idea of having to meet Connor again, how would the orphanage survive without the donations? \"There is no… other choice, right?\" Her stomach was feeling better, but the dead pictures stayed in her head. That hanging woman loomed over her heart, and it scared her to hell, but it was the only way. Sure, Connor and his ploys were scary, those pictures were scary, but losing the little life she already had was much scarier. \"I c-can continue to help!\"Miss Mary tensed up, the muscles of her face contracting and her teeth clashing in a tumultuous expression, but then it all eased and she looked defeated. She closed her eyes and spoke in the softest voice Jane had ever heard. \"Will there ever be a time when you forgive me for my incompetency?\"\"I-I'm not mad at you,\" Jane said with a raised pitch, \"I was never—\"\"I know,\" Miss Mary said as she brought her hands back around Jane, brining her for another embrace. \"I know…\"\n…\nAfter Jane's theatrical encounter with Connor and Miss Mary, she was sent to take a bath, change clothes, and rest in the nurse's office for a while. Miss Mary insisted for her to take the day—week—or even month off classes if she wanted to. As tempting as that was, she refused in fear of being a delinquent in the future. I'm f-fine, really was what she said to an angry looking Mary who mumbled I'll teach that bastard a lesson he won't forget in his life. It elated her to know that meanie was going to get his butt kicked.Jane put her blanket over her head and considered the status quo. The diary said nothing about Connor, so did the future already change? Jane hadn't acted anything differently yet. Last time, the future had changed due to how the anxiety Jane got from the diary affected her actions. This time, she just went about her day as normal. Sure, her thoughts were affected, but not her actions. If the future hadn't changed, then maybe Connor's visit did happen in the future of the diary. It probably just wasn't the highlight of the day for me to write it down… That would mean that the danger of the bully still loomed above. She grabbed the cloth of the warm blanket in the darkness and began biting down on it. Love when my day is just full of awesome, nice things!For a split second, she remembered Dean, his crayon, and his ferocious expression. I am sick of this! She had to put her mind to rest. She jumped out of the bed, put her shoes on, and walked through the hallways. It was noon time and classes must've started for most kids, leaving the hallways vacant. I can't believe I'm actually doing this! She stomped blindly into a hallway with the dead end and an art room door at its right. She entered and saw Miss Dervla gazing into one of the vase paintings Jane's class had drawn in the morning.Jane took a breath and spoke, \"Uh, M-Miss Dervla…\"\"Yes, love?\" Miss Dervla's attention stayed on the painting.\"C-can you show me th-the crayons we have…?\" Jane's voice was withering as her temper was returning to normal.\"You can check'em in the cabinet next to Pupu. I'm too… engulfed in this…\" her voice trailed off with a flourish.That would be better, actually. No need to interact with her more than needed.Jane rested on her knee and moved away Pupu's fallen head from the morning. It was sticky for some reason. No wonder nobody wanted to touch it. She then opened the rusted, cubical cabinet with a long screech. Inside it, she found sets of brushes, pencils, boxes of sharpeners and erasers, stacks of water colors, and finally, stacks of crayon boxes. She took one with the text Night Sky Hues (ONLY FOR €2.99!) out and opened it like a drawer. She found the green shade and drew a circle on her palm. It was yellowish and pale, nothing compared to the luminous green she'd seen on Alice's forehead. She stood up and extended the crayon to Miss Dervla.\"A-are these ones the only ones we h-have?\" she said in a shaky voice.Miss Dervla blue eyelids fluttered away from her painting of a green vase. \"Yes,\" she then went back to observe it.\"Th-the vase you're seeing right n-now, Miss, can I a-ask you something about it?\"\"Feel free.\"\"Do you th-think any pen in this orphanage would b-bring out this shade?\"She thought for a second. \"I do not think so. Dean drew this, but he used something special to do it.\"\"S-special?\"\"Yes.\" Miss Dervla looked at Jane. \"He used a broken heart.\" She then smiled, as if what she was saying actually made sense.Jane cast her eyes down at the pale crayon in her hand and shook her head. She put everything back together, thanked the art teacher, and walked out.Walking in the same hallway she had stomped through angrily not five minutes ago, she felt a weight anchoring her heart. In that moment, she knocked something with her shoe and it rolled on the ground. A sense of déjà vu pulsed through her. It was a crayon—the radiant crayon. Jane picked it, reading Starlight Color Works (SPECIAL ED- before the wrapping got cut off. She tested it, drawing a star on her hand. It was the exact same shade as she remembered. Bright as starlight.Why is this here? Yet again, Jane found this cursed pen rolling next to her shoe. The fight! She recalled it. Alice and Dean were fighting in this exact spot in the hallway earlier, so it must've fell from one of them. Even if the chances are low, this could still be Alice's pen! Jane picked her speed as gears spun in her brain. As she passed the railing of a descending staircase, a voice called to her from the hallway beyond.\"Jane?\"It was the voice of a boy with tidy brown hair, green eyes, and a bandage to the cheek.\"Where exactly did you get that from?\" Dean's voice sounded hollow.Jane gulped. \"Th-this is y-yours…?\"\"Yes,\" he said with a loud yell then coughed, \"yes, it's mine. Thanks so much for finding it.\" He extended an open hand to her.She extended hers, praying to not ask the question on her mind, praying to forget it all and not bother questioning the one thing that irked her more than anything right now. But as the pen touched Dean's finger, she withdrew it.\"Jane?\" his voice quivered.\"Th-th-th-this… this…\" It felt like the words were too big to come out of Jane's throat. \"This was t-taken by Miss Mary th-the day b-before yesterd-day… How did you g-get it?\"\"Oh, of course!\" he brushed away the sweat of his forehead, \"Alice stole it from me that day, and I got it from Miss Mary yesterday.\"Jane took a step back, holding the pen closer to her heart. \"M-Miss Mary w-was out a-all day yesterday…\"\"Jane,\" his voice dropped an octave, \"give me my crayon back.\"\"A-and even i-if—even if sh-she gave it b-back… Then who d-drew those scribbles on A-Alice today, huh?\" She began tearing up.\"I've always been nice to you, Jane. What happened?\" His eyes were laser-focused on the crayon still.\"L-Lier! Y-you are the bully! You w-were there, too! Wh-when I saw those w-writings on th-the wall…!\" I should've seen it coming, the diary had said, and it was right. But at this point, it was too late.Dean grabbed Jane from her forearm and she felt his fingers pressure bone. He shoved her aside and she faltered. He used that as an opportunity, taking the crayon off of Jane's hand and leaving scratch marks from his nails in the process.\"Give it up, bitch!\" he said with a growl.\"No!\" Jane cried, less about the pain or the crayon, and more to herself. She was truly stupid to fall for this guy. She was truly stupid in every meaning of the word.Her legs became weak, she fell to her knees, then began crying.\"Unlike Alice, I thought you knew your place, Patterson!\" Dean said from with a gravelly voice.Jane didn't see him directly, but she could see that his shadow was twisting atop the wooden floor, ready to kick her in the ribs, ready to break her nose.\"You coward!\" a voice said, and then a new shadow slammed onto the first one. \"Pick on someone your own size, twat!\"Jane looked up and saw the back of Alice's red shirt and black skirt. She was unsteady as she had Dean immobilized between her arms. His face was red and his veins protruded through skin.\"Get off me!\" He suddenly coiled his head back then slammed Alice right on. The two unlocked for a moment. Dean prepared his leg, but this time, for Alice. His kick was fast, and Alice was thrown down the staircase. In that moment, Jane could see an expression of surprise on Dean's face. He didn't realize there were stairs behind Alice, but it was too late.In horror, the two watched the girl tumble down step after step until she hit the white carpet at the end. A puddle of blood began oozing around Alice's head.Today, Jane Patterson was not bullied. But in avoiding that, she had caused something far, far worse to occur.Alice…?\"Oh, shit! W-what have we done?!\"Why are you in a puddle of blood, Alice?\"Jane, you s-saw, right?\"Did I do this to you…?\"I didn't know there were fucking stairs behind her!\"Right… the diary… the bully…\"You believe me—right, Jane? …J-Jane?\"I'm sorry, Alice…\"Oh, g-god,\" Jane fell to her knees.I was just scared…\"I killed her,\" she said in husky voice.\"Do not,\" Dean choked \"do not say that!\" But his words were like a zephyr attempting to topple a cactus; utterly pointless.\"I k-killed her…\" she repeated, and suddenly, there was a wave of energy—a form of deep frustration—that washed over her body, and as it reached her hands, her palms sprang into motion. \"Dummy! Dummy! Dummy!\" she cried aloud, her vision blackening with every thrash. \"Wh-what have I done…!\" Jane covered her face in shame, but her tears still rained down through the gaps between her fingers. There was the flicker of a thought, then the air froze.It's your blood in there, Alice, but it should be mine.Jane planted a foot down, and for the first time in a long time noticed how warm it is. It's unfair if it's only you, she thought to herself in a staticky mind. Another foot down, then she raised her back. It's the only way. She saw the edge of the stairs, stepped onto nothing, then there was a rush of air.I deserve this.But she stopped half-way through. She felt her weight stretching her sweater to its limit before she was pulled back. Air brushed against her neck, and abruptly, she was slammed against the wall and pinned in-place.\"Are you fucking mental!\" shouted Dean with pumping veins all across his red face.\"L-let me go!\" Jane struggled, but Dean didn't budge. \"I d-did this! Let me…! Move away! M-mo—\"All of a sudden, a vortex of suffocation choked at her throat. She gasped deep, but it felt like her lungs were punctured.\"This future…!\" she wheezed out, \"Is my… doing!\"\"The hell are you on about!?\" he shook her with enough strength to blow out her brain, \"Who even said Alice is Dead? She could be fine—c'mon!\"Jane took another gulp of air. Nothing. It just didn't seem to enter. Her legs began wobbling, and just as the image of quivering green eyes before her faded into black, she heard something.It was an nearly inaudible voice that went, ughhh.Jane shifted her deteriorating vision onto Alice. Her red-painted hair, covering the floor like a golden carpet, shuffled a little.\"Did I win…?\" she croaked half-unconscious, and that felt like the elixir of life to Jane. Her lungs huffed and puffed again, and she felt the weight of a whale falling off her shoulders.Dean stood up, eyes wide. \"I'll… I'll bring a teacher,\" he said before running off.Jane slid down her back against the wall until she sat on one of the steps. She going to be fine. she took a deep breath and repeated that a couple more times.\"You told me to wait here…\" Alice whimpered. \"Where are you…\"God, Jane began crawling down the staircase, please help me; for I have sinned. Her kneecaps hit corners hard, and her palms slipped, but she didn't stop. Tell me what can I do to make this right?\"Hey,\" Jane raised Alice's head off the floor. \"I'm r-right here…\"Her face was fully painted, and her hair was dry and sticky. The entire area exuded the strong smell of rust.\"You don't sound like mommy… Who are you…?\"\"I'm a f-friend,\" her mouth moved on its own.\"Oh,\" Alice groaned in surprise, her bloodied eyes still closed, \"is this… is this a prank…?\"Jane shook her head, \"No.\"\"Wow,\" Alice's head began feeling heavier in Jane's hand, \"that must be… really nice…\"Her body went limp, and Jane felt something horrifying hit her heart. She's just unconscious… She's just sleeping… She's—\"She's going to be fine,\" a voice said from above. It was Mr. Angelo. HIs blue eyes focused and acute as he descended the staircase in swift intent. \"You can stop worrying now, missy,\" he said as he cradled Alice in his arms. \"I recommend you clear your mind.\"\"Oh…\" Jane had no chance to ask or say before Mr. Angelo departed with Alice.\n…What happened after passed like the spark of lightbulb announcing its last light. Like how Mr. Angelo suggested, Jane's mind was clear, but not in the sense of being empty, but in the sense of being so noisy and so cluttered, that attempting to form a single intelligible thought seemed impossible. One second, it was a flash of Alice tumbling down the staircase, another, and it was that skeletal lady who hung herself.She had managed to wash, ate, and skip the afternoon class. But in her mind, she couldn't recall why her face wasn't dried, or whether she got the beans &amp; soup or the rice pudding, or where she went when she was walking aimlessly after skipping class.It was only when she was before the ajar door to Girls Dormitory C did her mind wake up.\"You heard? Mary and Angelo carried her to the hospital and all.\"\"Yeah, it's kinda serious…\"Jane pushed the wood aside, and her eye settled at the source of the gossip: Madison and her minions. Madison was leaning against the frame of her bunk, checking her nails with total ho-hum, while the other girls around her in a circle blabbered about.\"Didn't she just fell down the stairs accidently? How hard did she fall?\"\"Pretty hard, I reckon. Unless they're lying and someone maybe pushed her.\"As Jane passed the group, a brash—and very clearly annoyed—voice broke through.\"Ya'know, if you ask me, I never liked the attitude of that girl anyways,\" she snarled, \"She got what she deserves.\"In that moment, Jane felt a twig snap in her brain. And before she could even think about it, her mouth moved.\"No one is asking you, though,\" Jane muttered as she passed the crowd.\"What!?\" Madison gasped incredulously, \"Who said that?\"In a swift realization of the predicament she had put herself in, Jane slipped in the curtains of her bunk before anyone could lay eyes on her. It was then when she realized how loud her heart was. What did I just do?Whispers imploded in the group, and Jane could tell Madison was throwing some mad looks around.Jane crawled back a bit, and her elbow touched her pillow, but for some reason, it made a loud crackle.\"What was that?\" Madison growled, and Jane covered her mouth as to not make a noise.A big shadow loomed beyond the curtain. It extended an arm to the curtain, and Jane closed her eyes shut.\"Hey, I think that was the gum pack in my pocket,\" a girl said with nonchalance, \"Oopsies… You want one?\" a new shadow with a big ribbon atop its head approached Madison's giant silhouette and offered a hand.\"Sure,\" Madison said in a low, sustained note of suspicion. She appeared to take the gum, then leave—not just Jane, but the whole dorm. The others seemed to have followed suit from the sounds of the rustling and fading murmurs.After Jane waited a grueling a minute to make sure no one was around, she yanked her pillow away to find the culprit noisemaker.What the heck was that!It was a white paper bag with nothing on it. Jane didn't remember having it here before, so it must've been put by someone else. But who…? A student? A teacher?She teared it open and found two plastic-wrapped chocolate croissant and a folded paper. She opened the letter, which seemed to have come out of a small, spiral notebook, and began reading:Hey, kid. Sorry I showed all those pictures. Anyhow, here are some sweet stuff I'm giving you in exchange for future cooperation.P.S. Mary told me to do this.\nP.P.S. If you changed your mind, I have a bunch more pictures to show.\nP.P.P.S. Mary hits like a truck. Do not get on her bad side, kid.Jane couldn't have imagined herself be more insulted and more annoyed by reading such little text. You stupid, arrogant, mean cop…! she teared the paper to two, then four, then however there was at the end. She shoved everything back the paper bag and threw it below her bed.Did I talk back to Madison a second ago? she thought to herself in amazement. I didn't even stutter… Jane might've escaped Madison now, but who knows if she could do the same later. Madison was a scary girl, especially with her height.Now, Jane dropped her head and relaxed, clear your mind, he said… It's not like there's a switch for that, Mr. Angelo.She closed her eyes and took a deep breath, and the noises in her head weakened.Can I just blame Dean for this and stop feeling guilty? He, after all, was the one who sent Alice to the hospital. But without me being a total wuss, he would've hit me—I wasn't in front of a staircase, unlike Alice. So it is just me…She rolled to her side and sunk her hand into the mattress, her fingers pushed the fabric deep enough to touch something with a sharp angle.But perhaps it's all the diary's fault. If I hadn't read it, this also could've been avoided. So it's the diary's fault… Or maybe I'm just not the right person to use the diary. Ugh…With a fast motion, she curled her back up and leaned against her hands.I just want to talk to her—apologize.She opened her curtain and jumped down to her slipper.And if I can't right now, then I want to be the first to do so.\n…\nJane pushed two ornate, hardwood doors and exited through the small gap she made. The whistling of the wind danced across land before her. Beyond the worn down statue of Jesus with its open arms, and far above the rusty gates of the orphanage, clouds looked conflicted. Thunder seemed inevitable.\"Ah-choo!\" Jane wiped her nose and sat next to the doors. An icy wall chilled her back and she wiped her nose occasionally.I'll wait until she comes back, she thought, however long that might take.The wind whipped harder, and its singsong voice swept up and down. Suddenly, a hollow clank resonated in Jane's left ear. She looked to the side. It was a small, metal box—a mailbox. It resided atop a slanted pole and had its door ajar. One second, the wind opened with a screech, and in another, the wind slammed it shut.Jane looked away and back to the clouds. They seemed more irritated. In a blink, the world lit up in light as a spark hit it, and after the passing of a few seconds, the rumbling of the thunder shook the ground.\"What are you doing here?\" a weary voice said.Jane didn't answer.The person walked in front of her and stayed there, waiting for an answer. Jane looked up. It was Dean. He looked sleepy—even sick.\"Oh, it's y-you…\" there was a spark inside of Jane, but it lit no fire, as there was no fuel, \"S-sadly, there are no stairs to k-kick me down from…\"\"I wouldn't do that,\" he kept his gaze stern, \"You didn't answer me, still.\"\"It's… it's n-none of your business.\"\"…Okay,\" he glanced to the side, \"but don't tell the teachers.\"\"Why…?\"\"Seriously…?\" He made a flabbergasted huff. \"Of course it's because I don't want to be kicked out.\" He turned around and crossed his arms. \"And I told you already. I didn't know there was an inconveniently-placed staircase behind her. Not to mention…\" He turned back and gave Jane a pitiful look. \"Teachers won't believe Danger, but they might believe you.\"Jane had a sudden desire to punch him in the face. \"That's not what I mean,\" she said, irritated, \"Why do you b-bully Alice?\"Lightning struck again, but rain was yet to come.\"She always starts it,\" he glanced away again, \"She hits me, and I hit back. It's as simple as that, really.\"Jane sniffed her runny nose and looked down at the rough, concrete floor. \"I guess I'll tell the teachers,\" she said.The wind billowed, and though no light flashed, thunder shook the wall Jane had her back against. Dean had struck it with his foot. He descended his gaze and eyed her in vexation, his green eyes thin lasers. \"No, you fucking won't.\"Jane blinked, and the fear swishing her heart didn't move her, as she was anchored with something stronger. \"Then… don't lie to me.\"Lightning struck for the third time. Drip, drip, drip, the pitter-patter of rain drummed the ground until it became a wall of whooshing that drowned out all the other sounds. Thick drops of water splashed at the threshold below the overhang where Jane and Dean were.Dean drew his foot back. \"You know how Danger ended up here? Her mom abandoned her in park. Now,\" he pointed at himself, \"you wanna guess how I ended up here?\" he clapped his hands, \"Ding-ding-ding! The same damn thing—aside from the places.\" He brought his hand to his jaw and played with his mouth, twisting and squeezing it—testing it for the right words. \"I love my mom. I know she had some stuff to deal with. All adults do.\" He walked over to the mailbox and opened it. \"But I know for certainty that she will search for me one day. That's what any parent would do, right?\"Jane opened her mouth, but realized the question was rhetorical.\"Me and Alice are different,\" his raspy voice was barely audible in the wallowing of the skies. \"She doesn't wait. She doesn't care to do so. It's like,\" he laughed a little, \"she's proving my hope to be pointless. It fucking hurts, you know?\" He slammed shut the box, hitting its door in-place. \"I can't help but to hurt her back in any way I can.\" He came over to Jane and bent over. \"Are you happy now?\"Abruptly, the honk of a car pushed through the rain sounds. Jane turned her attention to it momentarily. She saw an individual entering the gate under an umbrella. When her attention returned to Dean, she found that he had entered.\"What are you doing here all alone, missy?\" Mr. Angelo said in a worried tone.\"Is…\" Jane held her chest and stood up, \"is Alice okay?\"\"As good as new,\" he said as he retracted the umbrella. \"Just a broken hand and a light concussion. She's staying the night in the hospital with the director.\"\"Really?\" Jane's heart fluttered, and she could her feel her lungs finally untightening. I didn't kill her, at least… She felt her legs rapidly weakening, but she held firm not to fall.\"So, missy, have you cleared your mind today?\" he inquired.\"Uhm,\" she played with her fingers, \"yeah… I think. It's why I'm waiting here…\"Mr. Angelo gave her a warm smile, \"Well, that's wonderful. But,\" he pinched her ear, \"it's too cold, and you know that. You could've caught a cold.\" \"Ow…!\" Pain waved in her ear as she whimpered, \"I'm sorry…\"Mr. Angelo sighed and let go of her. \"C'mon now,\" he held her hand, \"let's go inside. You can talk to Alice tomorrow when she's back.\"\n…\nThough Jane had cleared her mind the day before, that didn't mean she would have a goodnight catching Zs after almost causing killing Alice. I guess, on the bright side, no nightmares… she thought as she rubbed her weary eye.The door of the dormitory swung open, and Jane covered her ears from what was about to follow.\"Wake up, devils!\" shouted Miss Shingle in a high, swampy voice. \"If you're not out 'n about in five minutes, you will be defenestrated.\"What does that even mean? Jane thought as she sat at the edge of her bed, her face right against the rough fabric of the curtain. She slipped her feet into the googly-eyed slippers and just as her rear departed the mattress, she heard a thump right next to her foot.\"Oh, no,\" it was the diary, and it had fallen in such a way to be wide open. I shouldn't read it! but it was too late. Jane had glimpsed the page for one second, and that was enough to read the following: … found Alice … tried to talk … to apologize … didn't work … she didn't want my apology … didn't want to see my face … Jane closed the notebook and shoved it back where it belonged. Doesn't want my apology, huh… She had planned to wait for Alice all day today, to talk to her about what happened yesterday and apologize, and maybe, just maybe, be friends with her. But that's stupid, isn't it? Jane Patterson having things go her way for once? What a crazy idea… She wanted to cry.No! I can't let the diary play me every time. Even if it said it won't work, I would still like to try…\n…\nJane decided to skip classes for today—again. It was P.E., and the last thing she needed today was Mr. Carl yelling at her. You think that's clean, pumpkin? Think again! And while you do that, wipe every tile in this damn floor! Jane shook the image out of her head.She exited the ornate doors with a wooden screech and sat back in her spot. This time, with an extra sweater so Mr. Angelo won't complain. It was brightly red with the black drawing of a crucifix.Today, birds were chirping, the clouds were drifting, and thanks to yesterday's rain, Jesus was shinier than ever. Good for him, Jane thought, and her eyelids felt heavy. She'll come today… I've got to apologize to her… Her head began falling aside, and she caught it at the last second. Even if Diary Jane had failed. Her breathing began slowing. In the vision of her functional eye, the skies became dark, then the horizon line, then the ground, and then her mind.\"Meow…\"Hmm… What a strange-sounding cat…\"Mew? Meow!\"Cat, let me sleep… please…\"Meeeowwww!\"Jane's eyes opened wide, and her heart was pulled out of a dark ocean. Am I still dreaming? she thought as a pair of big, curious blue eyes watched her. There was a forehead covered in bandages, and streams of golden hair.\"A-Alice?\" Jane shrieked, her voice cracking.\"Mew?\" Alice titled her head in a questioning manner. \"Mew-mew!\" She limp-crawled to the door and tapped it with the cast that covered the entirety of her right arm. Please open it, was it what her big eyes pleaded.\"I leave you for one minute!\" a short lady in a white uniform and a red-crossed cap said as she hurried over. \"Christ… I don't get paid enough to deal with the crazy…\"Jane jumped at her and grabbed her white coat. \"Has Alice l-lost her mind?\" she said in a desperate cry.\"What?\" the nurse said aghast, \"No!\" She went over and grabbed Alice by the hem of her fire-red shirt, to which she got a Hisss!! \"Doctors suggested the thinnest chances of amnesia, and that got her all pumped up to start a new life as a cat!\"\"Oh…\" Something pulsated deeply within Jane.\"Hisss—let me go—sss!\" Alice clawed at the air with one hand.\"Shut up,\" the nurse said as she opened the hardwood doors and got in.A breeze washed over Jane's motionless body.She's just playing… That same thing—that feeling—pulsated within Jane once again. All those bandages and she's playing… It was a like pull of sorts, or a strong wind pushing the sails of her heart. And it's amnesia of all things! Like… what!? The island to which the wind sailed was but a dot at the horizon—simply too far. Ugh, never mind that, Jane dropped her head and pushed a palm against her forehead, I need to go talk to Alice—but, she shook her head, and her hair fell, that diary is telling it's not gonna work! She clashed her teeth, What a bitter, bitter situation…An idea bit the hook of her fishing rod.Bitter…\n…\n\"I don't wanna stay here!\" Alice drummed the sides of her bed next to a medicine-filled cabinet with a cracked glass door, \"Let me leave!\"\"Hell—I mean, heck no!\" the nurse said and took a sip from a steaming mug. \"Can't go nowhere with a broken leg, a broken arm, and your broken brain.\"\"Hissss—I'll steal your wallet while you're asleep—ssss!\"\"Sure, enjoy the spiders.\"\"Uhm,\" said Jane after realizing that the two wouldn't notice her any time soon. She kept her hands behind her back and her head down.Alice looked her way, to which Jane promptly looked way. Those blue, summer sky eyes ached Jane's heart. Instead of Alice, Jane decided to give her attention to the nurse instead for now.\"God da—I mean, great. Another one,\" she gave Jane a cheap, and clearly fake, smile. \"Any boo-boo you want me to glue-glue?\"Jane shook her head.\"Woah, legit? Splendid,\" the nurse executed a slick double-snap to a pair-of-guns combo before pulling out a newspaper from a near drawer. It was titled TRAGEDY IN AMBERLEY STREET: THE EYES STRIKES AGAIN.The Godeyes are moving again… Jane almost brought her hands to her chest out of habit, but she kept them behind her. I might hate you, Conner, but I wish you luck. You'll probably need it.Jane stood there for a second, not sure what or who to look at. Her plan was to talk with the nurse long enough to have some confidence and then move over to Alice, but that clearly didn't work. Oh, c'mon! You can't change the future for the better of you can't even look at it!Jane kicked the floor soldier-like, and rotated her body like a machine. \"Hey th-there, Alice…\"\"You're the girl from yesterday.\" Alice studied Jane up and down. \"You seem fine.\"Jane walked up to the bed, looking down at where Alice's hand met her blanket instead of looking directly in the eyes. \"Thanks t-to you,\" she said with a fluctuation of volume. \"So… you know…\"\"Yeah?\"\"About that… I j-just wanted to say…\" Each word felt bigger than the last. She swallowed what's in her mouth and prepared herself. \"I'm really s-sorry for all that ha-happened to you…\" her eyes began feeling hot, \"It's all m-my fault in the end.\"Jane's spine quivered. Each second of silence felt like a century, and many seconds passed. It was just before tears began spilling when Alice's voice rumbled in an unusual timber. \"I don't want your apology.\" The hint of displeasure in her voice was immense.\"R-right…\" Even though this was what the diary had foretold, it still really stung. It makes sense. I wouldn't take an apology from me either, Alice.\"I just wanna get outta'ere,\" Alice murmured to herself in hollow tone.Jane raised her sight to meet Alice's downcast gaze. \"I r-reckon there's a way, actually…\"Alice looked up, her summer skies a wide radial bloom, \"For reals?\"Jane nodded with enthusiasm. \"The nurse is c-concerned that you might get hurt…\"\"And why's that, huh?\" Alice crossed her arms, \"You think I'm some old, brittle chocolate bar? You think I'm breakable?\"\"Uhh,\" Jane looked at her right leg covered in a cast, her left arm in the same material, and then the bandages on her forehead.Her eyebrows dropped flat. \"I'm breakable on the outside—sure, but not the inside!\" She struck her heart three times, \"Down there, it's all steel and stuff… and breakfast.\"\"That wouldn't help l-leave this place…\"Alice clicked her tongue, \"Guess your right. Continue.\"\"What I'm g-getting at is that you n-need help… like, a help…er… helper…\" Jane looked down as what was she about to say felt quite embarrassing. \"L-l-like me… I c-could d-do that…\"\"That's total baloney!\" Alice threw a finger in the direction of the seemingly careless nurse reading her newspaper, \"This stubborn nurse ain't letting me leave because I got some help…er—or whatever!\"\"Actually,\" the nurse interjected and sipped from her mug, \"she's right.\" She then looked up from the dense black and white pages and gave Jane a thoughtful look. \"You're a smart kid.\"\"What!?\" Alice's jaw was on her lap. \"I… I…\" she sounded almost out of breath, \"I don't… want to.\" Her eyes glanced to Jane, but only for a split-second. \"I would rather stay here.\"Do you hate me this much, Alice? Her heart was burning, and she wanted to run and cry until her pillow was soggy.But I guess I've already thought it will come to this.Slowly, Jane brought her hands from behind her back and presented Alice with a white, paper package that had already been opened.Everyone hates bitter things, and likewise, everyone loves sweet things.Alice's noses flared up and her mouth opened. \"What is this smell? It's so nice…\" she gulped.Especially if they're in a place with no sweats to be found.Jane placed the package gently in Alice's lap. \"You c-can have this, if I can help you…\"Jane could swear she saw a dark summer night in Alice's eyes as she pondered the offering.\"Okay,\" she put her hand in and pulled out one of the croissants, \"but just because I'm hungry! You…\" she paused and her voice dropped, \"you might help, I guess…\"This was like a cold waterfall that washed Jane's scorched heart tissue. It felt soothing. So soothing, that Jane barely held up anymore. She sat herself in almost a fall at the bed next to Alice's.\"Splendid work, kids. Now, I get more free time to waste,\" the nurse said with a big grin on her face. \"Now take a crutch from the closet and get out the fu—I mean… Just get out.\"Alice looked Jane's way and smiled a little. Jane's lips couldn't help but copy what they were seeing. But Alice's smile was brushed way fast, and she simply looked aside. Maybe Jane was exaggerating in that moment, but the feeling she read on Alice's face was most-likely,Regret.\"Great. Juuuust what I wanted,\" Alice groaned as she leaned on her crutch.\"It's d-dangerous,\" Jane said as she matched her pace with Alice.\"You're boring. Do you have a pen?\" Alice extended her free hand.\"Uhm,\" Jane searched her pocket. She pulled out a blue pen and gave it to her.\"Thanks,\" she took it.The two step within the threshold of the cafeteria, with it's tall pillars and lengthy tables, and like a domino effect, each head in the area turned its way to them. Jane dropped her gaze. She felt unsafe when this much attention fell on her. She used Alice's feet as guidance.She ain't dead? Maaan, one dude said aloud. Pfft, at least she got what she deserved, a girl said as she pretended to whisper. Who's that next to her? New victim? another guy chuckled.Jane checked on Alice. It was almost as if she couldn't hear them. But Jane could tell that her eyes fall down for a split-second every time someone mentioned her dying. It was now that Jane truly realized the magnitude of what Alice goes through—but most importantly, the shame to think Jane used to think like these people before.Make it up for her Jane thought and took a firm step, nudging Alice in the shoulder. \"You didn't t-tell why you wanted that pen.\"Alice took a second to wake up from her thoughts, \"Oh, yeah…\" She leaned over to Jane and whispered, \"I heard that, in movies, the girl with the broken arm gets signatures on her cast. The more there is, the more boys she gets…\"That's a silly idea… Jane looked around, and saw that most people went back to their daily yapping and munching. \"Oh, y-yeah…? Who's signature you're getting f-first?\"\"Hear this,\" she leaned even closer and wagged her eyebrows, \"Mr. Gula, the chief. I'll take a bunch of teacher signatures and say they're from hot foreign dudes.\" She chuckled, and it eased Jane's many wounds, \"Mr. Gula? More like, Mister Gulaquanee: American prince in love with one Alice Danger.\"Jane couldn't help but to smile, \"I don't think the Americans have p-princes.\"\"You're smart. You make up the stories.\"\"Of course,\" Jane said. I would do anything to amend things.Alice slowed down her crutch, her upbeat brows falling and her gaze looking away from Jane. \"Actually,\" she sighed in quiet, \"don't bother with that. And about the pen. I will give it back once this helper thing is over.\"\"Wh-why…?\" Jane couldn't understand what she did wrong to drop the mood this many octaves. It was going so well…Alice shook her head, \"Don't bother.\"The two then proceed to awkwardly walk up to Mr. Gula behind the serving line. He looked as short and as chubby as usual, with his abnormally tall chief hat,.\"Mind signing my cast, Mr. Gula?\" Alice said casually as she flopped her heavy hand on the aluminum table.The chief came over and pondered as he looked at the white bandages of the cast. \"I don't know no signacha, girl,\" he said and put mashed-potato-filled platter next to her hand.Well, that plans a bust, Jane thought.Later that day, the girls had ran into a problem.\"A-Alice, it would be better if you didn't s-sleep there…\"Alice looked up at her bunk. \"What's the worse that could happen? I double-break one of my bones?\" she asked herself.\"It's better t-to sleep here,\" she opened the curtain to her bed.\"I can't believe I'm letting go of the high grounds,\" Alice's shoulders dropped, \"Take care of it for me.\"\"Uhm,\" Jane brought her hands together, not knowing how to word this. \"I am s-scared of h-heights…\" she said looking away and feeling her face burning. I thought no one would get to know that embarrassing fact.Alice looked from the top bunk to Jane. \"That is not high, buddy.\"\"I-it is… for me…\"\"I guess,\" Alice leaned her crutch against the bed frame, \"we can sleep in the same bunk.\"Thank god I didn't have to suggest that.The two got in, and Jane closed the curtains.\"Why have curtains anyways? You hiding something?\" Alice rolled under the blanket to face Jane, and her blue eyes glowed in the dark.\"N-not particularly,\" except for the diary.\"Hmm, it's only for a few weeks anyways.\"As Alice began rolling to face the opposite side, Jane opened her mouth. \"S-so.. about yesterd—\"\"I said I don't want your apology,\" she said with a thorny voice, \"and I don't want to talk about it. Now we sleep.\"Jane wanted to bury herself in the ground. She might've not been able to alter the diary's prediction for the better, but she changed it without a catastrophe. It was a slow game. But there was still one thing in Jane's mind.\"You o-okay?\"\"Why wouldn't I?\" said Alice.\"They were saying… a lot of mean stuff.\"Alice paused. \"That's alright,\" her voice shivered slightly, \"I'm used to it.\"\"Why not tell the t-teachers? About Dean, that is.\"\"And what? Get him kicked or something? Nah, I don't want that. Besides,\" she tightened her grip on the blanket, \"I know it was an goof on his part.\"\"You,\" Jane stopped herself, but she was too deep in to look back, \"You c-can't tell the teachers, b-because they won't believe you…\"Alice took a quiet breath, her chest expanding, \"That, too, I guess.\"So you don't want him kicked out for a goof, but you don't have the choice to decide on that, Jane thought.\"You know,\" Alice rolled back to meet Jane's gaze with a sneaky smile, \"I always knew you slept below me, but I never knew your name.\"\"It's… J-Jane Patterson,\" she pushed out, feeling weird to say it loudly for once.Alice flicked her index and smacked Jane's forehead. \"Well, good night, Jay-Jay.\"\"Ow!\" Jane brushed the pained area, and not a second later, she realized what she had heard. Her face turned full-on volcanic-alert-mode. She covered her face.\"G-good night,\" she said, feeling that same deep curiosity in her towards Alice. Her desire to make things right grew.The following day, Jane found that she had a surprisingly good sleep. But why? Her mind couldn't remember what had caused a nightmare-protective shield to be summoned around her heart. All she remembered where imaginary dreams of Alice calling her Jay-Jay. Psh, as if that would… and then she realized it, Oh, that actually happened. She looked around her. Alice was no where to be found. Out of the side curtain, Jane found that Alice's crutch was nowhere to be found. She can't go alone! What if something bad happened to her!Jane jumped off the bed and made a run for it.\"Woah! Morning run, Jane?\" Lucy had said, but Jane no time to reply.\"Oh, Miss Patterson!\" a sing-song voice called in the middle of a hall. \"Got some good news.\"As Jane approached and began having as clear vision of the speaker, her brows began furrowing. \"Miss D-Derv—you? What?\"\"Oh, love, your painting yesterday was deliciously entertaining,\" she licked her fingers and a slimy shiver ran down Jane's spine. \"Showed it a dear friend of a mine, and he was thrilled!\"Jane nodded, \"N-nice—really cool, Miss… Now,\" she walked around the lady with the wide smile, \"I got to g-go. Bye…\"She began her fast pace and realized she had no specific place to find Alice in. Where would someone like her go…? She recalled what Alice said to the nurse: I want my freedom! She stopped in a 4-way cross and had decided to go in the direction with a light at the end. The backyard.As the bright light emerged closer, a figure came in through. An angry and stomping one, with flat shoulders and a tensed neck.\"Why have I bother with that… Ugh,\" that sound was familiar, \"I should've just—damn it!\"\"D-Dean…?\" Jane's throat clogged.\"Off my sight,\" he grumbled as he walked past her.What was that about…? A scary thought came to mind. No, it can't be. No more fast pacing, she ran as fast as she could outside. Please tell me I'm wrong. Jane crossed the threshold and her eyes began adjusting. A small green hill with an arched tree met here eye, and she saw a girl walking up to the tree with her crutch. There were some other kids playing, but they didn't mind Jane running—thinking she was doing the same.\"Alice!\" her stich was killing her, \"Did he hurt you?\"By the time she reached the tree, she collapsed to the ground and heaved air.\"Jay-Jay?\" Alice turned slowly, \"Who—Dean? Nah, he just came to say some stupid stuff.\"\"Oh,\" Jane coughed against the grass, \"good…\"\"Wow, you're, like, gone… Want me to carry you?\"Jane raised a hand, \"No, I'm f-fine.\" She pushed herself up with some serious effort. \"More i-importantly, where are you g-going alone?\"\"A prince is in need of saving, and I must fulfill my duty,\" she said with a fist to the heart.\"B-but what if—\"Alice wagged a finger, \"No butts, no ifs. This is private business, Officer Jay-Jay. You need to retreat before I take your badge.\"Jane looked down the blades of grass waving below her and accepted that her efforts to convince Alice otherwise would be futile. \"Okay,\" she said, and Alice wondered off somewhere beyond the arching tree.I guess she still hates me deep down, she thought to herself and remembered the diary. She was curious to see it now.First, she read the entry she didn't finish: Hey there diary,\nI tried to make it up for Alice today. I tried to apologize. It didn't work. Of course it didn't work! Why would it work? I don't deserve for it to work! I am the worst! The worst! The worst!Self-deprecating comments that would have discouraged me? That makes sense. Not reading it was the right choice.Then, she proceeded to read today's prediction, preparing for the worst this time: Hi diary,\nToday, my efforts continue to appease Alice Danger. And though progress is showing, there seems to be a barrier I cannot cross. A fortress she has built around her heart.I'm not sure what to do, Diary.Just like the prediction of the diary, the went on, and whenever Jane helped Alice, improved her mood, or anything alike, Alice would retreat upon reaching a certain point. Just like how she did in the cafeteria, or near the tree.What was interesting was that the entry had not caused a change for the worse, nor the better. It was neutral.The next day passed along, and nothing of note had happened.It was only until Sunday, when things began changing…\n… Dear diary,\nToday, we were in the church, and Dean decided to steal Alice's crutch for some reason—that bastard! I don't know where he hid it, and the teachers say Alice is the one who lost it. I'm sorry Alice. I wish I could be better.Besides that disaster, I met a strange man today. I don't know who he is, but it seems that my legs don't like him that much…Disaster once again. Jane had decided to read the entire entry this time, her self-esteem from her small success with Alice had given her the motivation, but this threatened that energy.\"Wha'cha reading, Jay-Jay?\" Alice peered from the curtains.Jane smashed the notebook closed and buried it in her chest, \"N-n-nothing…\" She felt bad for lying, so she added, \"Just my d-diary…\"\"Private stuff… I get it,\" she pointed her thumb away, \"We have Sunday school today, and the van is almost ready.\"Jane nodded like a paper fan in a hot day, \"I'm c-coming!\"With a thumbs up, Alice drew her head out of the bunk, and Jane felt her muscles lose all tension. That was close… in fact, it was the closest anyone had ever been to the diary. The thought of Jane telling Alice everything flickered in her mind, but evaporated like tears in the oven. I don't her to call me crazy.Later that day, when everyone had arrived to the church, the kids were told by Miss Mary to sit to only at the right benches. When they got in, it was apparent that was because kids that had come with their parent—or parents, for that matter—sat at the left benches.\"Maybe I should return to being a cat,\" Alice said as she leaned her crutch against the edge of the wooden bench, \"that would be a nice time-passer.\" She took a seat next to Jane.\"I th-think I prefer h-human Alice,\" Jane said as she glanced quickly at the crutch.\"You think?\"\"Hey, l-look!\" Jane pointed at one of the windows ahead, \"a cloud shaped like a… a handsom p-prince!\"\"Seriously?\" and just like that, Alice's attention was diverted.Jane stretched her spine hard, making sure not to either make a noise, nor to touch Alice's neck in any way. Her finger touched the plastic handle of the crutch.\"I don't see it… Hold on, actually,\" Alice leaned forward, which opened just enough of a gap to grab the wooden crutch. Jane held it firm in her hand and swung it around her side.Got you! she thought victoriously as she put it below her bench. Let's see how you take her crutch, Evergreen!\"It's more like a heavily misshaped frog prince,\" Alice said with a disappointed look, \"but I do like frogs, so I guess I can marry it.\"Jane nodded and the two girls went quiet for a while. Lucy, Madison, and the rest of their gang were giggling in the front bench. Dean, right behind them, had his head rested on his palm, his expression solemn. She looked at what he was looking at.\"Mooom,\" a kid in Jane's age groaned, \"this sweater's funky, and my back's all itchy!\"\"Oh, please!\" his mother patted his shoulders, \"You'll get used to it.\"This felt painful to see. What future can I change to have this? Jane thought to herself. She looked back at Dean, then to Alice. She was looking the complete to the opposite of the children and their parents, at the skyline with its clouds and greens. It's like a coin, Jane imagined.\"Alright, kids… Settle down, settle down…\" The paster raised waving hands behind his podium. \"Before we begin today's song, I want to announce our theme: the sin.\"\"Father Jones, I heard a sin is like a tooth,\" Desmos said with a raised hand.The pastor chuckled, \"Oh, no, no,\" he leaned over his podium and his wrinkly hands showed his age, \"Sin is an immoral act, it's a divine transgression, and it's something bad we do—it's in our very nature.\"The boy next to Lucy raised his hand, \"Just like the parents who've abandoned us?\" His tone was aggressive. \"What's the punishment for their sin?\"Dean turned his head towards the pastor, eager to hear an answer.\"It's a grave sin, my boy—grave…\" the pastor raised a hand to his formal suit, right at his chest. \"But I believe, personally, that people may act sins as a result of harsh circumstance.\"Dean's eyes glittered, and he said something to himself—Jane could tell from his lips, but she couldn't hear.\"Pfft,\" Alice smirked and shrugged, \"yeah, surely.\"\"Now, now, young lady. You mustn't let go of all hope.\"Alice's eyebrows clashed together, and her lips were pressed hard as she crossed her hands.Alice… Jane extended a hand to her, and Alice shoved it aside.\"Your stupid song is beginning,\" she mumbled and didn't look in Jane's way.\"I'm s-sorry,\" Jane shimmied away from Alice and gave her some space. Jane sniffled and sang with the other kids in a low volume, making sure not to mix her voice in too much.Are you washed in the blood,\nIn the soul-cleansing blood of the Lamb?The wall of man, women, and children singing flooded the church. The candles of the chandelier at the center of the room suddenly got extinguished, and a cold breeze washed over the benches.Are your garments spotless?\nAre they white as snow?Jane glanced at Alice. She wasn't singing. She sat in silence with crossed arms and downcast head. Jane saw a glimpse of tidy brown hair behind the arm rest next to Alice, and she knew what was up.Are you washed in the blood of the Lamb?Jane looked ahead fast, and Dean was not there anymore.\"Agh!\" a thump, a sharp inhale, and Alice was holding her abdomen with a pained expression.\"A-Alice,\" Jane swept in and held her shoulder gently, \"W-what did he d-do?\"Alice shook her head, \"Nothing. Leave it be.\"Jane stood up. This can't go on for long. If you can't tell on him, and he won't stop, then I have to do something. She felt the crowd's eyes hit her one by one, and the wall of songs seemed impossible to crash.Move, dummy! She passed Alice and off the bench.\"What are you doing?\" Alice said in a panicked whisper, \"It won't work! It will never work!\"Jane ignored her, she focused her might on her movement, fueled by the rage she had reserved for Dean. You lied to me. You played me. You tried to hurt me, and you hurt Alice!The singing pushed her back like a storm. So many people, so much attention, so much trouble.Are you walking daily by the Savior's side?\nAre you washed in the…The singing stopped. Everyone was looking at Jane. She fastened her steps, and by the time she crossed the line of the front stage, where Miss Mary saw her, she needn't to move anymore.\"Dear?\" Miss Mary stood up and approached, \"What is it?\"Jane made a tight fist, and as if she punched the air, she pinpointed her index at where Dean sat. \"He h-h-hit Alice in the stomach!\"Dean's eyes widened like a pray under a shadow, and his demeanor shriveled.\"It…\" Miss Mary looked up at him, \"It can't be…\"\"I-it can! Believe me!\"Dean pulled the hem of his shirt, \"I don't know what she's talking about, Miss Director… She must saw wrong.\"People began whispering names and questions.Miss Mary looked back at Jane, still unconvinced. \"Look, maybe Alice started it?\"Jane clashed her teeth, a tear stuck out to the edge of her eye. \"Believe me, Miss!\" That's it, Jane couldn't take this for longer. \"He didn't j-just do that, by the way, he was the one who kicked Alice down the s-stairs! I saw it happen!\"The look of doom spread across every face in the church as they all looked at Dean.\"That's… that's…\" He was sweating bullets and fluctuations of his expression were unstable. \"That's just a lie! She's lying!\"Miss Mary gave her attention to Alice. \"You told me you slipped…\" Her eyes were dark.Alice dropped her head low and didn't say anything.\"Miss Director, you can't possibly believe this—\"\"Dean,\" Miss Mary looked at him with a deadly expression, one not to be tampered with, \"go wait in the van.\"Jane looked at her hands. They were shivering. She made them fists, but they were still shivering. She wanted to cry. This was too much.\"Thanks for telling me,\" Miss Mary's rough hand patted Jane, \"and sorry I doubted you—even for a second.\"Jane nodded and walked back fast to her place near Alice.Her heart was beating so hard, she was surprised she didn't die right then and there from a heart attack. People were whispering and looking, but Jane's vision was as narrow as a straw, and her hearing was practically closed off from the pressure on it. As if far as she was concerned, Alice didn't talk to her, and the class continued as usual—though, with a lot of murmuring mixed in.It was finally when she felt that her body parts had calmed down, Jane began taking in her surroundings once more. It must've been the end of the class, because most kids were gone except the few who was still talking and peeking at Jane. She got out of the bench and a deep voice rumbled behind her.\"I think this belongs to you,\" the man said.Jane turned and found her own painting from before. A vase with a shattered eye. She took it and looked at the man who had it in his hands. He wore a black shirt under a slick suit. A blue cross medallion hanged from his neck.It was a stranger.He smiled, his void eyes sedate and his hairless brows arched. \"You must be Jane Patterson.\"\"Y-yeah…\" She remembered, from just a few days ago: Showed it a dear friend of a mine, and he was thrilled! \"You g-got this from Miss D-Dervla…?\"The man nodded, \"She's quite enthusiastic about this stuff and shows me pieces all the time. I had a visit planned here already, so I thought come by and personally give it to you.\"But why go through the effort?He kneeled and brought his eyes to Jane's level. \"I hear today's theme is sin?\" his eyes narrowed, and his apparent interest peaked. \"Tell me, what do you believe to be the best way to cleanse the sin?\"Jane thought about her sin: the diary, her tampering with the future, and the broken bones in Alice. \"You… w-work hard to m-make for it?\"\"No, child, it's not enough. You must erase its existence. You see,\" The man began stretching his ring-riddled hand towards Jane, \"If I don't know,\" Jane wanted to move away, but she couldn't, \"and if you don't know,\" his words were like a hypnotizing ocean, \"and if everyone doesn't know,\" the man's hand brushed aside the hair hiding Jane's silver eye, and his face flickered with ecstasy, \"the no one knows!\"\"Brother Oswald…? Some minutes, please?\" the pastor said from behind him.The man stood up in a swift, strong motion and turned. \"Yes, brother, of course,\" and so, the stranger walked away, and Jane's heart began to beat again.What was that all about… Something tugged her sweater.\"You wake,\" Alice said with an intrigued expression and leaned on Jane's shoulder.\"I… w-wasn't asleep.\"\"Oh,\" Alice blushed a little, \"I thought you were…\" She coughed into the stub of her cast. \"Have you seen my stick?\"\"Your c-crutch?\"\"Yeah, whatever it's called.\"\"Uh,\" I didn't think how I would explain this to her! \"so, I hid it b-below our bench…\"Alice narrowed her eyes. \"Why?\"Jane played with her fingers and her head was steaming, \"B-because I… didn't want anyone to tr-trip on it! Y-yeah! Let me just bring it over…\"Alice let go of Jane and hopped to the bench.\"I can—\"\"Nah, I want.\" She took out the bench with some difficulty, and rested on it.Alice lightly tapped Jane's leg through the long fabric of her skirt. \"So, I just want to say thanks for what you did there.\" She looked up and smiled, a free and unchanged smile. Jane could see the walls of the castle Alice had built flickering away in the glimmer of her eyes.It was like a torch burning in her heart. It lit up a ruddy apartment that had long forgotten the warmth of light. Jane held her chest and dropped her gaze. She was unable to stop any tear from flowing.\"Jay-Jay? Are you okay?\" Alice wiped the tears away with her chubby hand.\"I'm sorry,\" Jane hiccupped, \"I'm really sorry…!\"Alice frowned. \"Why? What have you done to apologize?\"\"I… I was th-the one who c-caused all your i-injuries… It's m-my fault!\"\"Jay-Jay,\" Alice bonked her on the head, \"think clearly. Why would you have caused all of it? That doesn't make sense…\"\"But,\" Jane held the top of her pained head, \"but,\" she couldn't say it. She couldn't bring up that that future was her doing. It was torture.\"Jay-Jay, I told you this before. I don't want your apology.\" Alice tried soothing Jane.It was like a lightbulb. That wasn't her rejecting my apology. She never blamed me once. She never hated me once. She never judged me once.\"I see now...\" Jane said through sludgy sniffs.Alice sighed a sigh of relief. \"Let's get outta'ere shall we?\" She walked over a couple of steps then looked back. \"You okay? Why not move?\"Jane looked down at her shoes. \"I don't know… I'm t-trying.\" It wasn't working. She tried again, and it was almost as if her legs were cut from her body, or that hands had them pinned down.Alice came over and pushed Jane from the back, and suddenly, her feet began working again. \"There you go.\"\"Thanks, Alice.\"The two left and had a couple of minutes before the van went back to the orphanage.They decided to spend those minutes looking at the clouds and interpret their looks.Both of them had the time of their life.","aliases":[],"inlineTags":[],"frontmatterTags":["#MNSCRPT"],"headers":[{"heading":"Chapter 1: The Foretelling Diary","level":1,"id":"Chapter_1_The_Foretelling_Diary_0"},{"heading":"Chapter 2: Godeyes","level":1,"id":"Chapter_2_Godeyes_0"},{"heading":"Chapter 3: Danger","level":1,"id":"Chapter_3_Danger_0"},{"heading":"Chapter 4 Part 1: Broken Cat","level":1,"id":"Chapter_4_Part_1_Broken_Cat_0"},{"heading":"Chapter 4 Part 2: Sin","level":1,"id":"Chapter_4_Part_2_Sin_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"jane-patterson-and-the-foretelling-diary.html","pathToRoot":".","attachments":[],"createdTime":1758837314520,"modifiedTime":1769106571659,"sourceSize":136298,"sourcePath":"PROJECTS/Jane Patterson and the Foretelling Diary/Manuscripts/Jane Patterson and the Foretelling Diary.md","exportPath":"jane-patterson-and-the-foretelling-diary.html","showInTree":true,"treeOrder":0,"backlinks":[],"type":"markdown"}},"fileInfo":{"jane-patterson-and-the-foretelling-diary.html":{"createdTime":1758837314520,"modifiedTime":1769106571659,"sourceSize":136298,"sourcePath":"PROJECTS/Jane Patterson and the Foretelling Diary/Manuscripts/Jane Patterson and the Foretelling Diary.md","exportPath":"jane-patterson-and-the-foretelling-diary.html","showInTree":true,"treeOrder":0,"backlinks":[],"type":"markdown","data":null},"site-lib/fonts/70cc7ff27245e82ad414.ttf":{"createdTime":1769120262244,"modifiedTime":1769120262244,"sourceSize":192740,"sourcePath":"","exportPath":"site-lib/fonts/70cc7ff27245e82ad414.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/454577c22304619db035.ttf":{"createdTime":1769120262245,"modifiedTime":1769120262245,"sourceSize":161376,"sourcePath":"","exportPath":"site-lib/fonts/454577c22304619db035.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/52ac8f3034507f1d9e53.ttf":{"createdTime":1769120262247,"modifiedTime":1769120262247,"sourceSize":191568,"sourcePath":"","exportPath":"site-lib/fonts/52ac8f3034507f1d9e53.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/05b618077343fbbd92b7.ttf":{"createdTime":1769120262246,"modifiedTime":1769120262246,"sourceSize":155288,"sourcePath":"","exportPath":"site-lib/fonts/05b618077343fbbd92b7.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/4bb6ac751d1c5478ff3a.woff2":{"createdTime":1769120262239,"modifiedTime":1769120262239,"sourceSize":7876,"sourcePath":"","exportPath":"site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/c504db5c06caaf7cdfba.woff2":{"createdTime":1769120262251,"modifiedTime":1769120262251,"sourceSize":352240,"sourcePath":"","exportPath":"site-lib/fonts/c504db5c06caaf7cdfba.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/01dcbad1bac635f9c9cd.woff2":{"createdTime":1769120262252,"modifiedTime":1769120262252,"sourceSize":387976,"sourcePath":"","exportPath":"site-lib/fonts/01dcbad1bac635f9c9cd.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/media/6155340132a851f6089e.svg":{"createdTime":1769120262241,"modifiedTime":1769120262241,"sourceSize":315,"sourcePath":"","exportPath":"site-lib/media/6155340132a851f6089e.svg","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/media/2308ab1944a6bfa5c5b8.svg":{"createdTime":1769120262241,"modifiedTime":1769120262241,"sourceSize":278,"sourcePath":"","exportPath":"site-lib/media/2308ab1944a6bfa5c5b8.svg","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/scripts/webpage.js":{"createdTime":1769118220685,"modifiedTime":1769118220685,"sourceSize":110729,"sourcePath":"","exportPath":"site-lib/scripts/webpage.js","showInTree":false,"treeOrder":0,"backlinks":[],"type":"script","data":null},"site-lib/media/favicon.png":{"createdTime":1769120262118,"modifiedTime":1769120262118,"sourceSize":1105,"sourcePath":"","exportPath":"site-lib/media/favicon.png","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/styles/snippets.css":{"createdTime":1769120262340,"modifiedTime":1769120262340,"sourceSize":476,"sourcePath":"","exportPath":"site-lib/styles/snippets.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/obsidian.css":{"createdTime":1769120262326,"modifiedTime":1769120262326,"sourceSize":213374,"sourcePath":"","exportPath":"site-lib/styles/obsidian.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/global-variable-styles.css":{"createdTime":1769120262191,"modifiedTime":1769120262191,"sourceSize":1672,"sourcePath":"","exportPath":"site-lib/styles/global-variable-styles.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/main-styles.css":{"createdTime":1769118220723,"modifiedTime":1769118220723,"sourceSize":19521,"sourcePath":"","exportPath":"site-lib/styles/main-styles.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/rss.xml":{"createdTime":1769120262518,"modifiedTime":1769120262518,"sourceSize":130743,"sourcePath":"","exportPath":"site-lib/rss.xml","showInTree":false,"treeOrder":0,"backlinks":[],"type":"other","data":null}},"sourceToTarget":{"PROJECTS/Jane Patterson and the Foretelling Diary/Manuscripts/Jane Patterson and the Foretelling Diary.md":"jane-patterson-and-the-foretelling-diary.html","":"site-lib/rss.xml"},"featureOptions":{"backlinks":{"featureId":"backlinks","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".footer","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Backlinks","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"tags":{"featureId":"tags","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header .data-bar","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"showInlineTags":true,"showFrontmatterTags":true,"info_showInlineTags":{"show":true,"name":"","description":"Show tags defined inside the document at the top of the page.","placeholder":""},"info_showFrontmatterTags":{"show":true,"name":"","description":"Show tags defined in the frontmatter of the document at the top of the page.","placeholder":""}},"alias":{"featureId":"aliases","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header .data-bar","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Aliases","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"properties":{"featureId":"properties","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Properties","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"info_hideProperties":{"show":true,"name":"","description":"A list of properties to hide from the properties view","placeholder":""}},"fileNavigation":{"featureId":"file-navigation","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#left-sidebar-content","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"info_includePath":{"show":false,"name":"","description":"","placeholder":""},"showCustomIcons":false,"showDefaultFolderIcons":false,"showDefaultFileIcons":false,"defaultFolderIcon":"lucide//folder","defaultFileIcon":"lucide//file","defaultMediaIcon":"lucide//file-image","exposeStartingPath":true,"info_showCustomIcons":{"show":true,"name":"","description":"Show custom icons for files and folders","placeholder":""},"info_showDefaultFolderIcons":{"show":true,"name":"","description":"Show a default icon of a folder for every folder in the tree","placeholder":""},"info_showDefaultFileIcons":{"show":true,"name":"","description":"Show a default icon of a file for every file in the tree","placeholder":""},"info_defaultFolderIcon":{"show":true,"name":"","description":"The icon to use for folders. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_defaultFileIcon":{"show":true,"name":"","description":"The icon to use for files. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_defaultMediaIcon":{"show":true,"name":"","description":"The icon to use for media files. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_exposeStartingPath":{"show":true,"name":"","description":"Whether or not to show the current file in the file tree when the page is first loaded","placeholder":""},"includePath":"site-lib/html/file-tree.html"},"search":{"featureId":"search","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#left-sidebar .topbar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Search...","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"outline":{"featureId":"outline","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar-content","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Outline","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"startCollapsed":false,"minCollapseDepth":0,"info_startCollapsed":{"show":true,"name":"","description":"Should the outline start collapsed?","placeholder":""},"info_minCollapseDepth":{"show":true,"name":"","description":"Only allow outline items to be collapsed if they are at least this many levels deep in the tree.","placeholder":"","dropdownOptions":{"1":1,"2":2,"No Collapse":100}}},"themeToggle":{"featureId":"theme-toggle","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar .topbar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"graphView":{"featureId":"graph-view","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Graph View","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"showOrphanNodes":true,"showAttachments":false,"allowGlobalGraph":true,"allowExpand":true,"attractionForce":1,"linkLength":15,"repulsionForce":80,"centralForce":2,"edgePruning":100,"minNodeRadius":3,"maxNodeRadius":7,"info_showOrphanNodes":{"show":true,"name":"","description":"Show nodes that are not connected to any other nodes.","placeholder":""},"info_showAttachments":{"show":true,"name":"","description":"Show attachments like images and PDFs as nodes in the graph.","placeholder":""},"info_allowGlobalGraph":{"show":true,"name":"","description":"Allow the user to view the global graph of all nodes.","placeholder":""},"info_allowExpand":{"show":true,"name":"","description":"Allow the user to pop-out the graph view to take up the whole screen","placeholder":""},"info_attractionForce":{"show":true,"name":"","description":"How much should linked nodes attract each other? This will make the graph appear more clustered.","placeholder":""},"info_linkLength":{"show":true,"name":"","description":"How long should the links between nodes be? The shorter the links the more connected nodes will cluster together.","placeholder":""},"info_repulsionForce":{"show":true,"name":"","description":"How much should nodes repel each other? This will make disconnected parts more spread out.","placeholder":""},"info_centralForce":{"show":true,"name":"","description":"How much should nodes be attracted to the center? This will make the graph appear more dense and circular.","placeholder":""},"info_edgePruning":{"show":true,"name":"","description":"Edges with a length above this threshold will not be rendered, however they will still contribute to the simulation. This can help large tangled graphs look more organised. Hovering over a node will still display these links.","placeholder":""},"info_minNodeRadius":{"show":true,"name":"","description":"How small should the smallest nodes be? The smaller a node is the less it will attract other nodes.","placeholder":""},"info_maxNodeRadius":{"show":true,"name":"","description":"How large should the largest nodes be? Nodes are sized by how many links they have. The larger a node is the more it will attract other nodes. This can be used to create a good grouping around the most important nodes.","placeholder":""}},"sidebar":{"featureId":"sidebar","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"allowResizing":true,"allowCollapsing":true,"rightDefaultWidth":"20em","leftDefaultWidth":"20em","info_allowResizing":{"show":true,"name":"","description":"Whether or not to allow the sidebars to be resized","placeholder":""},"info_allowCollapsing":{"show":true,"name":"","description":"Whether or not to allow the sidebars to be collapsed","placeholder":""},"info_rightDefaultWidth":{"show":true,"name":"","description":"The default width of the right sidebar","placeholder":""},"info_leftDefaultWidth":{"show":true,"name":"","description":"The default width of the left sidebar","placeholder":""}},"customHead":{"featureId":"custom-head","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"head","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"info_includePath":{"show":false,"name":"","description":"","placeholder":""},"sourcePath":"","info_sourcePath":{"show":true,"name":"","description":"The local path to the source .html file which will be included.","placeholder":"","fileInputOptions":{"makeRelativeToVault":true,"browseButton":true}},"includePath":"site-lib/html/custom-head.html"},"document":{"featureId":"obsidian-document","enabled":true,"unavailable":false,"alwaysEnabled":true,"hideSettingsButton":false,"allowFoldingLists":true,"allowFoldingHeadings":true,"documentWidth":"40em","info_allowFoldingLists":{"show":true,"name":"","description":"Whether or not to allow lists to be folded","placeholder":""},"info_allowFoldingHeadings":{"show":true,"name":"","description":"Whether or not to allow headings to be folded","placeholder":""},"info_documentWidth":{"show":true,"name":"","description":"The width of the document","placeholder":""}},"rss":{"featureId":"rss","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"siteUrl":"","authorName":"","info_siteUrl":{"show":true,"name":"","description":"The url that this site will be hosted at","placeholder":"https://example.com/mysite"},"info_authorName":{"show":true,"name":"","description":"The name of the author of the site","placeholder":""}},"linkPreview":{"featureId":"link-preview","enabled":false,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":true}},"modifiedTime":1769120262343,"siteName":"Jane Patterson and the Foretelling Diary","vaultName":"WritingCabinet","exportRoot":"PROJECTS/Jane Patterson and the Foretelling Diary/Manuscripts","baseURL":"","pluginVersion":"1.9.2","themeName":"obsidian-current-theme","bodyClasses":"publish css-settings-manager styled-scrollbars show-inline-title show-ribbon is-focused","hasFavicon":false}